[{
    "id": 1,
    "text": "You decide to unwind at the Sleeping Lion, but just as you are starting to relax, a bear of a man crashes into your table, scattering your drinks across the floor.\nTowering over him is a massive Inox. \"What did you say about my horns?\" the Inox shouts.\nThe main stands up and brushes shards of glass from his tunic, \"I said the sight of them makes me want to vomit!\"\nThe Inox roars and charges headlong into the man, crashing through more tables in the process. At this, the entire tavern erupts into violence. After all, when a man is deep into his drink, the last thing you want to do is knock that drink over.",
    "option_1": "Join the fray! These insults will not go unanswered!",
    "option_2": "Do your best to stop the fighting. This is a respectable establishment.",
    "default_outcome_1": "Nothing like busting some drunken skulls to lift one's spirits. It turns out to be a great way to unwind. Unfortunately, the proprietor of the Sleeping Lion doesn't exactly see it that way, and he sullenly asks for compensation for the damage you caused.",
    "default_outcome_1_rewards": ["Gain 10 experience each", "Either lose 5 gold each or lose 1 reputation."],
    "default_outcome_1_cycle": true,
    "default_outcome_2": "After restraining the enraged Inox and offering to replace the drinks of a few of the more belligerent patrons, you calm the place down a bit. Some of the non-human patrons are understandably on edge, but the proprietor thanks you for your efforts and reimburses you for the drinks.",
    "default_outcome_2_rewards": ["Gain 1 reputation."],
    "default_outcome_2_cycle": true
  },
  {
    "id": 2,
    "text": "As the daylight fades, you find yourselves wandering through a half - crowded market street, browsing wares.\n\"Hey! Over here!\" You turn in the direction of the voice to see a filthy Vermling gesturing from dark alley \"Yeah, you grim-looking chaps.I have something you might be interested in.\n\"The Vermling holds out a piece of metal covered in sludge.\"Found this in the sewer.Writing on it I don 't understand, but I know it's valuable.You can have it for ten gold!\"",
    "option_1": "Pay for the thing.You never know.",
    "option_2": "Refuse to pay, Never trust a Vermling.",
    "default_outcome_1": "\"Bah! You don't have enough.Come back when you do !\"",
    "default_outcome_1_rewards": ["No effect"],
    "default_outcome_1_cycle": true,
    "pay_outcome_1_cost": "PAY 10 COLLECTIVE GOLD",
    "pay_outcome_1": "You hand over the gold and take hold of the piece of garbage.Amidst troubling brown smears you see lot of meaningless scratches likely made by rats and bugs.Oh well.Sometimes the long shot doesn't pay off",
    "pay_outcome_1_cycle": true,
    "pay_outcome_1_rewards": ["No effect"],
    "default_outcome_2": "You laugh and gesture the Vermling away. You can recognize a low - life swindler when you see one.And that piece of garbage was just...foul.",
    "default_outcome_2_rewards": ["No effect"],
    "default_outcome_2_cycle": true
  },
  {
    "id": 3,
    "text": "As the daylight fades, you find yourselves wandering through a half - crowded market street, browsing wares.\n\"Hey! Over here!\" You turn in the direction of the voice to see a filthy Vermling gesturing from dark alley \"Yeah, you grim-looking chaps.I have something you might be interested in.\n\"The Vermling holds out a piece of metal covered in sludge.\"Found this in the sewer.Writing on it I don 't understand, but I know it's valuable.You can have it for ten gold!\"",
    "option_1": "Pay for the thing.You never know.",
    "option_2": "Refuse to pay, Never trust a Vermling.",
    "default_outcome_1": "\"Bah! You don't have enough.Come back when you do !\"",
    "default_outcome_1_rewards": ["No effect"],
    "default_outcome_1_cycle": true,
    "pay_outcome_1_cost": "PAY 10 COLLECTIVE GOLD",
    "pay_outcome_1": "You hand over the gold and take hold of the metal. You wipe off the grime and slop to discover a foreign contraption made of large gears and many moving parts.If you can f ure out what it is,this device might actually be of some worth.",
    "pay_outcome_1_cycle": false,
    "pay_outcome_1_rewards": ["Gain 1 collective \"Curious Gear\" (Item 125)", "Global Achievement: Ancient Technology"],
    "default_outcome_2": "You laugh and gesture the Vermling away. You can recognize a low - life swindler when you see one.And that piece of garbage was just...foul.",
    "default_outcome_2_rewards": ["No effect"],
    "default_outcome_2_cycle": true
  },
  {
    "id": 4,
    "text": "Having recently returned from your latest adventure, you are approached by a ratty - looking boy in tears.\n\"Please, sirs, could you please help me with my cat ? He went over there, and I'm afraid.\" The boy points a dirty finger at a decrepit, abandoned building \"l don't know what else to do.\"",
    "option_1": "Find a cat? You have more important things to do.",
    "option_2": "Reassure the boy and go find the cat.",
    "default_outcome_1": "You shake your head and direct the boy to go find his mother With any luck she will knock some sense into him so that he stops troubling strangers with such trivia matters.",
    "default_outcome_1_rewards": ["No effect"],
    "default_outcome_1_cycle": false,
    "default_outcome_2": "You approach the Foreboding house full of heroic bravado.There's certainly nothing otherworldly about the structure but its fallen beams and piles of rubble do make it difficult to look around By the time you find the cat hiding under a burned-out bed frames you are utterly exhausted.At least the boy is ecstatic his cat has been found.",
    "default_outcome_2_rewards": ["Lose 1 (CHECKMARK) each", "Gain 1 reputation."],
    "default_outcome_2_cycle": false
  },
  {
    "id": 5,
    "text": "After resting for the evening, you start out your day noticing a great number of prominent, commanding posters around the city.\nReading one, you learn that the Sanctuary of the Great Oak is laying down the foundation For a new building on the east side of Gloomhaven. Everyone is encouraged to come and help.This could be an important community event.",
    "option_1": "Go help lay the foundation.",
    "option_2": "Take the opportunity to steal some valuables in the area while people are distracted.",
    "default_outcome_1": "Amidst a great deal of revelry, you put all you have into laying the foundation of the sanctuary. Surely much good will be done here healing the sick and wounded.After all your exhaustive efforts, though, you might end up being their first patients.",
    "default_outcome_1_rewards": ["Lose 1 (CHECKMARK)", "Gain 1 reputation.", "Gain 1 prosperity"],
    "default_outcome_1_cycle": false,
    "default_outcome_2": "You head to the prosperous east side of town, not to help lay down the foundation, but to steal some goods from shopkeepers too silly to lock up their wares during the festivities. You make off with a good deal of money and the distracted guards are none the wiser ",
    "default_outcome_2_rewards": ["Gain 5 gold each.", "IF Reputation < -4: Gain 5 additional gold each"],
    "default_outcome_2_cycle": false
  },
  {
    "id": 25,
    "text": "On a trip to the Coin District, you catch sight of an old, wiry Valrath carrying a large, intricate vase out his front door. As you get closer, the Valrath begins to struggle with the vase, sweat pouring from his brow. Under the strain, the Valrath loses his balance, and the fragile vase topples downward as he yells a string of curses.",
    "option_1": "Attempt to catch the vase.",
    "option_2": "With no time to react, watch the vase fall to the ground.",
    "class_outcome_1": "You race forward and wrap your arms around the vase.You manage to keep grip of it, preventing tragedy.The Wrath is relieved and offers to pay you for your trouble if you carry it the rest of the way ",
    "class_outcome_1_requirements": ["BERSERKER", "CRAGHEART", "BRUTE"],
    "class_outcome_1_rewards": ["Gain 5 collective gold"],
    "class_outcome_1_cycle": false,
    "default_outcome_1": "You race forward to catch the vase, but it is too much for you. Your grip loosens and the vase shatters into a hundred pieces.The Valrath is irate, demanding compensation from you for breaking it. You pay him what you can.",
    "default_outcome_1_rewards": ["Lose 10 collective gold."],
    "default_outcome_1_cycle": false,
    "default_outcome_2": "You watch helplessly as the vase careens out of the Valrath's grasp and once it connects with the hard ground shatters into a hundred pieces.The Valrath looks distraught and a little angry You exchange a sympathetic glance with him and then continue about your business.",
    "default_outcome_2_rewards": ["No effect"],
    "default_outcome_2_cycle": false
  }
]