[{
    "id": 1,
    "title": "Black Barrow",
    "party_achievements": ["First Steps"],
    "new_locations": [2],
    "introduction": "The hill is easy enough to find-a short journey past the New Market Gate and you see it jutting out on the edge of the Corpsewood, looking like a rat under a rug. Moving closer you the mound is formed from a black earth. Its small, overgrown entrance presents a worn set of stone stairs leading down into the darkness.\nAs you descend, you gratefully notice light emanating from below. Unfortunately, the light is accompanied by the unmistakable stench of death.You contemplate what kind of thieves would make their camp in such a horrid place as you reach the bottom of the steps. Here you find your answer - a rough group of cutthroats who don't seem to have taken very kindly to your sudden appearance. One in the back matches the description of your quarry.\n\"Take care of these unfortunates,\" he says, backing out of the room.You can vaguely make out his silhouette as he retreats down a hallway and through a door to his left.\n\"Well, it's not every day we get people stupid enough to hand-deliver their valuables to us,\" grins one of the larger bandits, unsheathing a rusty blade.\"We'll be killing you now.\"\nJoke's on them. If you had any valuables, you probably wouldn't be down here in the first place.",
    "treasures": [7],
    "goal": "Kill all enemies",
    "conclusion": "With the last bandit dead, you take a moment to catch your breath and steel yourself against the visions of living remains ripping at your flesh. Your target is not among the dead, and you shudder to think what horrors still await you in the catacombs below. (2)"
  },
  {
    "id": 2,
    "title": "Barrow Lair",
    "requirements": ["First Steps"],
    "new_locations": [3, 4],
    "introduction": "The stench of death and rotting flesh gets thicker as you kick past the corpses of your foes and head deeper into the underground burial site. Guided by the muffled sounds of conversation, you find your way through the maze of crypts and burst into a small room full of hard-faced bandits, all with bows at the ready.\nThey're clearly guarding something. You must be in the right place.",
    "treasures": [67],
    "goal": "Kill the Bandit Commander and all revealed enemies",
    "conclusion": "Sifting through the carnage left by the battle, you find a cache at the back of the room containing the scrolls you were hired to collect. You can't help but rifle through them a bit, but find that the writing upon them is in some unknown archaic language. One thing that does jump out at you, however, is a map of the northern countryside. A bend in the Still River is clearly marked as a point of interest. Contemplating whether you want to find out more about this so-called \"Gloom,\" you decide that the spot could be a point of interest for you, as well. (4)\nBut that can be forgotten for the moment. You pack up the papers and head back to Gloomhaven to collect your reward.\nMeeting Jekserah once again at the Sleeping Lion, you hand over the papers and are paid the agreed-upon amount.\n\"You know,\" she whispers to you softly under the bustle of the tavern. \"If you're interested, I may have another job for you. A tribe of Inox in the Dagger Forest has ransacked a couple of my caravans headed to the Capital.\"\n\"I told the militia, but they do nothing,\" she spits. \"I can point you in the direction of their encampment. If you can make an example of them, I will pay you even more.\"\nShe places a crude map of the forest on the table and stands up, her jewelry clinking with the movement. \"Come find me when it is done.\" (3)"
  },
  {
    "id": 3,
    "title": "Inox Encampment",
    "anti_requirements": ["The Merchant Flees"],
    "party_achievements": ["Jekserah's Plans"],
    "new_locations": [8, 9],
    "treasures": [65],
    "goal": "Kill a number of enemies equal to five times the number of characters",
    "introduction": "So this merchant wants to make an example of some caravan raiders? Seems reasonable enough. For the right amount of money, almost anything can be made reasonable.\nYou enter the Dagger Forest and begin to track down the encampment using Jekserah's crude map. It is well-hidden, but following the signs outlined on the parchment, you find a dense cluster of huts in a small clearing of the forest. All that's left is to head in and make that requested example.",
    "conclusion": "Running through the forest, fleeing the smell of burning flesh, you now find more than enough opportunity to contemplate your actions.\nHow your actions sit with you must be visible on your face as you meet once more with Jekserah, this time in her manor. She hands you a sack of coins with a frown.\n\"They were thieves and murderers, \"she says blankly.\"They deserved what you gave them. And that is all I will say of the matter.I have one more task I would like you to perform.I require a diamond of considerable size for a customer, but I cannot find one anywhere in the city.\"\n\"There is a diamond mine, however, in the southern mountains long since lost to the wilderness. I've heard reports that it is now overrun with Vermlings, no doubt with some other more intelligent force behind them.If you can fight your way in and grab the biggest diamond you can find, I will give you a considerable reward.(9)\"\n\"Now leave me in peace.\"Jekserah's two massive Inox bodyguards step forward, directing you to leave the manor.\nOutside, contemplating your new task, you hear a small voice behind you.\"She's not looking for profit, you know.”\nYou turn around to see a female Quatryl step out of the alley beside Jekserah's house.She's clad in dark leather armor and holds a conspicuous contraption full of whirring gears and topped with a conical metal piece connected to a tube.\n\"Argeise, city guard, \"she says, introducing herself.\"I know, I don't exactly look the part, but if anyone isn't what they appear to be, it's that Valrath you've been talking to. Sure, she's a merchant, but she's up to something far more sinister.\"\n\"She's been trying to overthrow the military in Gloomhaven for as long as I've been here, and we're all very curious about what her current machinations are.\"\n\"Look, you can go do her bidding like a good little puppy if you want, but if you'd rather actually help this town keep the peace and not get overrun by the wilds, I have a different idea. We'll get to the bottom of Jekserah's plans and expose her for who she really is.\"(8)"
  },
  {
    "id": 4,
    "title": "Crypt of the Damned",
    "new_locations": [5, 6],
    "introduction": "The bandit commander's proclamations of a \"Gloom\" do not sit well in your stomach as you search the bend in the Still River - something here holds an interest for these maniacs.\nYou are somewhat surprised to find the ruins of an ancient crypt half - covered in moss and ivy.The history of this place is old and dark.With no other information to go on, you head down into the depths.Whatever these supposed bandits are up to, you're determined to find out, even after you stumble across a large group of them and more animated dead at the bottom of the stairs.\n\"You've made a mistake coming here\" one of the bandits hisses. You disagree. You are right where you want to be.",
    "treasures": [38, 46],
    "goal": "Kill all enemies",
    "conclusion": "It is clear that you have disrupted some sort of ritual here. These elemental demons belong on an entirely different plane of existence, but the cultists have somehow managed to pull them through to this one.\nOn the altar in the back room, there is a wealth of scribblings on these rituals. Not all the writing is intelligible, but you get the sense that this crypt is a place of power once used by an ancient civilization. The ancients tapped the power of the elements to enhance their own lives, and while their exact fate is beyond your knowledge, it clearly didn't end well.\nAmong the scripts you also find notes on a couple of other places of power in the area.One appears to see heavy use with the cult and the other is marked as being overrun by vicious undead.It looks as though you have opportunities to either disrupt more of their work(5) or get in their good graces by helping to clear out a threat.(6)"
  },
  {
    "id": 5,
    "title": "Ruinous Crypt",
    "new_locations": [10, 14, 19],
    "goal": "Kill all enemies",
    "introduction": "Your mission is clear. These elemental cultists are distorting the fabric of the world and must be stopped. With that goal in mind, you follow the writings to an ancient crypt you believe to be the cult's base of operations. Steeling yourselves for combat, you batter through the rotted door and charge into the hall of the crypt.\nThe sight before you is both wondrous and horrifying.A group of cultists is performing ritual incantations in front of a black, gaping hole in reality.They turn toward you and snarl, unsheathing their sacrificial daggers. Behind them an inky darkness spills forth from the hole and coalesces into nightmarish forms full of teeth and claws.You know you must send these terrors of the elemental plane back into the void, but you are paralyzed with fear.",
    "conclusion": "With the cultists and their minions dead, it seems the dark rift is now dormant. It is no less disconcerting, however. You toss a rock at it, and the rock disappears into nothingness. You must admit that you wonder whether you could enter the rift yourself and whether you could survive the trip to wherever that rock ended up. (10)\nAlternately, finding some way to close the rift is probably the more prudent decision.There is an Aesther enchanter in Gloomhaven who may know more about this inter - planar stuff.She's been known to ask for impossible favors before she helps anyone, though.(14)(19)",
    "treasures": [4, 28]
  },
  {
    "id": 6,
    "title": "Decaying Crypt",
    "party_achievements": ["Jekserah's Plans", "Dark Bounty"],
    "new_locations": [8],
    "treasures": [50],
    "goal": "Reveal the M tile and kill all revealed enemies",
    "introduction": "What is life without a little bit of intrigue? The cultists have clearly marked this crypt as a spot of trouble for them. Perhaps clearing the place out will put you in their good graces. Or maybe you're just hoping to find a big stash of treasure, untouched by looters' hands.\nOnce you arrive, the smell makes you regret your decision more than anything else. It's not the fact that you've had it about up to here with exploring old decrepit ruins. It's not the undead horrors shambling and moaning in the shadows. It's the smell.The smell of death and soullessness and rotting flesh.",
    "conclusion": "After the terrible shrieks and moans of the undead, the sound of someone clapping is at once foreign and alarming. Turning around, you see a hooded figure standing at the edge of your torchlight. You raise your weapon, but the grin on his silhouetted face isn't menacing in a way that calls for arms. It is menacing in a way you've never experienced before.\n\"Well done, sirs, \"the figure lilts. \"My, my, but you do have a way about you, don't you? And you've certainly gotten our attention now, removing this troublesome crypt of its rogue undead element.We very much prefer our undead to be the controllable variety, now don't we?\"\nThere is a long pause as the figure stares at you, still grinning.\n\"Well, perhaps you'd be so kind as to do us another favor? After which we'll be mostly settled on the whole issue of you murdering some of my brethren.\" He stops grinning.\n\"There's a necromancer in Gloomhaven. Been giving us a spot of trouble, sending mercenaries out to do her dirty work against us. Maybe you've met her.\"\n\"Kill Jekserah. Bring her head to our headquarters, and we'll see about letting you live.\"(8)"
  },
  {
    "id": 7,
    "title": "Vibrant Grotto",
    "requirements": ["The Power of Enhancement", "The Merchant Flees"],
    "new_locations": [20],

    "introduction": "You gingerly step into the entryway of the Crooked Bone, careful to avoid the broken glass, nails, and other treacherous things. You glance around the room and see nothing but the usual detritus. Before you can call out to Hail, though, an explosion from an upper room violently shakes the entire building.\n\"Damn it all to the abyss!\" Hail's disembodied voice yells out.\"I set up my work in the most out-of-the-way, uninviting, decrepit little hovel, and grand idiots still manage to stumble in and disrupt my research.\"\n The translucent woman suddenly appears before.\"You do know that your mere presence in this building changes the flow of the ether, causing unanticipated currents that produce catastrophic consequences, right? I mean, how could you not know that ?\"\nHail closes her eyes and begins to take deep breaths, fading a little out of view with each exhale.\"Yes, I did agree to help you.I had hoped the memory was a nightmare of some kind, but it wasn't, so that can't be helped now.The least you can do inreturn, however, is to warn me before you cross the threshold.\"\nShe gives you an icy stare.\"So what do you want, anyway? Let' s make this quick.\" You explain to her the situation with Jekserah and the need to locate where she is hiding.\n\"Ah, a simple scrying matter? Well then, we are in luck, \" Hail begins. \"Or rather, I' m in luck.The main component I would need for such a task is biteroot, and I ran out of it just last week.I was going to gather more, but now I can just send you out to get it instead. Everyone wins!Except those infernal forest imps who terrorize my usual gathering spot. I hope quite a few of them will end up dead.\"\nA small map drops in your hand, and, with a wave of Hail's arms, a sudden, powerful force pushes you out the door.\"Remember: ring the bell when you come back and wait fortyseven seconds before entering the door!\"\nYou are able to follow the map to a network of small caves just north of the Dagger Forest.The place is teeming with life: lush, massive plants, as well as a number of hostile animals and imps.You prepare for their attack."
  },
  {
    "id": 8,
    "title": "Gloomhaven Warehouse",
    "requirements": ["Jekserah's Plans"],
    "anti_requirements": ["The Dead Invade"],
    "global_achievements": ["The Merchant Flees"],
    "new_locations": [7, 13, 14],
    "treasures": [51],
    "goal": "Kill both Inox Bodyguards",
    "conclusion": "With the battle behind you, you look out the window and see no evidence of the fleeing Valrath. You've stopped her plans for now, but after your brief conversation, it is clear you need to hunt her down before she can make good on her threats. (13)\n\"She's beyond my network, \"the city guard Argeise says with a shrug when you ask her later. \"We'd like to make sure she won't cause more trouble, but she's fled the city, and I'm not about to go traipsing through the wilds.\"\n\"You might have more luck with the Aesther enchanter in town, \"she suggests. \"She can surely divine the coward's location for you, if you can get her to cooperate.\"(14)(7)"
  },
  {
    "id": 9,
    "title": "Diamond Mine",
    "anti_requirements": ["The Merchant Flees"],
    "global_achievements": ["The Dead Invade"],
    "new_locations": [11, 12]
  },
  {
    "id": 10,
    "title": "Plane of Elemental Power",
    "anti_requirements": ["The Rift Neutralized"],
    "party_achievements": ["A Demon's Errand"],
    "new_locations": [21, 22]
  },
  {
    "id": 11,
    "title": "Gloomhaven Square A",
    "anti_requirements": ["End of the Invasion"],
    "global_achievements": ["City Rule: Economic", "End of the Invasion"],
    "new_locations": [16, 18]
  },
  {
    "id": 12,
    "title": "Gloomhaven Square B",
    "anti_requirements": ["End of the Invasion"],
    "global_achievements": ["End of the Invasion"],
    "new_locations": [16, 18, 28]
  },
  {
    "id": 13,
    "title": "Temple of the Seer",
    "global_achievements": ["End of the Invasion"],
    "new_locations": [15, 17, 20]
  },
  {
    "id": 14,
    "title": "Frozen Hollow",
    "global_achievements": ["The Power of Enhancement"]
  },
  {
    "id": 15,
    "title": "Shrine of Strength"
  },
  {
    "id": 16,
    "title": "Mountain Pass",
    "new_locations": [24, 25]
  },
  {
    "id": 17,
    "title": "Lost Island"
  },
  {
    "id": 18,
    "title": "Abandoned Sewers",
    "new_locations": [14, 23, 26, 43]
  },
  {
    "id": 19,
    "title": "Forgotten Crypt",
    "requirements": ["The Power of Enhancement"],
    "party_achievements": ["Stonebreaker's Censor"],
    "new_locations": [27]
  },
  {
    "id": 20,
    "title": "Necromancer's Sanctum",
    "requirements": ["The Merchant Flees"],
    "new_locations": [16, 18, 28]
  },
  {
    "id": 21,
    "title": "Infernal Throne",
    "anti_requirements": ["The Rift Neutralized"],
    "global_achievements": ["The Rift Neutralized"],
    "conditional_achievements": ["Artifact: Recovered"]
  },
  {
    "id": 22,
    "title": "Temple of the Elements",
    "requirements": ["A Demon's Errand"],
    "alt_requirements": ["Following Clues"],
    "global_achievements": ["Artifact: Recovered"],
    "new_locations": [31, 35, 36]
  },
  {
    "id": 23,
    "title": "Deep Ruins",
    "requirements": ["The Power of Enhancement"],
    "party_achievements": ["Through the Ruins"],
    "global_achievements": ["Ancient Technology"],
    "new_locations": [26]
  },
  {
    "id": 24,
    "title": "Echo Chamber",
    "party_achievements": ["The Voice's Command"],
    "new_locations": [30, 32]
  },
  {
    "id": 25,
    "title": "Icecrag Ascent",
    "party_achievements": ["The Drake's Command"],
    "new_locations": [33, 34]
  },
  {
    "id": 26,
    "title": "Ancient Cistern",
    "requirements": ["Water-Breathing"],
    "alt_requirements": ["Through the Ruins"],
    "party_achievements": ["Following Clues"],
    "new_locations": [22]
  },
  {
    "id": 27,
    "title": "Ruinous Rift",
    "requirements": ["Stonebreaker's Censor"],
    "anti_requirements": ["Artifact:Lost"],
    "global_achievements": ["The Rift Neutralized"]
  },
  {
    "id": 28,
    "title": "Outer Ritual Chamber",
    "requirements": ["Dark Bounty"],
    "party_achievements": ["An Invitation"],
    "new_locations": [29]
  },
  {
    "id": 29,
    "title": "Sanctuary of Gloom",
    "requirements": ["An Invitation"],
    "global_achievements": ["The Edge of Darkness"]
  },
  {
    "id": 30,
    "title": "Shrine of the Depths",
    "requirements": ["The Voice's Command"],
    "party_achievements": ["The Scepter and the Voice"],
    "new_locations": [42]
  },
  {
    "id": 31,
    "title": "Plane of Night",
    "requirements": ["The Power of Enhancement", "Artifact: Recovered"],
    "global_achievements": ["Artifact: Cleansed"],
    "new_locations": [37, 38, 39, 43]
  },
  {
    "id": 32,
    "title": "Decrepit Wood",
    "requirements": ["The Voice's Command"],
    "new_locations": [33, 40]
  },
  {
    "id": 33,
    "title": "Savvas Armory",
    "requirements": ["The Voice's Command"],
    "alt_requirements": ["The Drake's Command"],
    "party_achievements": ["The Voice's Treasure", "The Drake's Treasure"]
  },
  {
    "id": 34,
    "title": "Scorched Summit",
    "requirements": ["The Drake's Command"],
    "anti_requirements": ["The Drake Aided"],
    "lost_achievements": ["The Drake's Command"],
    "global_achievements": ["The Drake Slain"]
  },
  {
    "id": 35,
    "title": "Gloomhaven Battlements A",
    "requirements": ["A Demon's Errand"],
    "anti_requirements": ["The Rift Neutralized"],
    "lost_achievements": ["A Demon's Errand"],
    "global_achievements": ["City Rule: Demonic", "Artifact: Lost"],
    "new_locations": [45]
  },
  {
    "id": 36,
    "title": "Gloomhaven Battlements B",
    "requirements": ["A Demon's Errand"],
    "anti_requirements": ["The Rift Neutralized"],
    "lost_achievements": ["A Demon's Errand"],
    "global_achievements": ["The Rift Neutralized"]
  },
  {
    "id": 37,
    "title": "Doom Trench",
    "requirements": ["Water-Breathing"],
    "party_achievements": ["Through the Trench"],
    "new_locations": [47]
  },
  {
    "id": 38,
    "title": "Slave Pens",
    "party_achievements": ["Redthorn's Aid"],
    "new_locations": [44, 48]
  },
  {
    "id": 39,
    "title": "Treacherous Divide",
    "party_achievements": ["Across the Divide"],
    "new_locations": [15, 46]
  },
  {
    "id": 40,
    "title": "Ancient Defense Network",
    "requirements": ["The Voice's Command", "The Voice's Treasure"],
    "global_achievements": ["Ancient Technology"],
    "new_locations": [41]
  },
  {
    "id": 41,
    "title": "Timeworn Tomb",
    "requirements": ["The Voice's Command"],
    "global_achievements": ["The Voice Freed"]
  },
  {
    "id": 42,
    "title": "Realm of the Voice",
    "requirements": ["The Scepter and the Voice"],
    "anti_requirements": ["The Voice Freed"],
    "lost_achievements": ["The Voice's Command"],
    "global_achievements": ["The Voice Silenced"]
  },
  {
    "id": 43,
    "title": "Drake Nest",
    "requirements": ["The Power of Enhancement"],
    "global_achievements": ["Water-Breathing"]
  },
  {
    "id": 44,
    "title": "Tribal Assault",
    "requirements": ["Rethorn's Aid"]
  },
  {
    "id": 45,
    "title": "Rebel Swamp",
    "requirements": ["City Rule: Demonic"],
    "new_locations": [49, 50]
  },
  {
    "id": 46,
    "title": "Nightmare Peak",
    "requirements": ["Across the Divide"],
    "global_achievements": ["End of Corruption"],
    "new_locations": [51]
  },
  {
    "id": 47,
    "title": "Lair of the Unseeing Eye",
    "requirements": ["Through the Trench"],
    "global_achievements": ["End of Corruption"],
    "new_locations": [51]
  },
  {
    "id": 48,
    "title": "Shadow Weald",
    "requirements": ["Redthorn's Aid"],
    "global_achievements": ["End of Corruption"],
    "new_locations": [51]
  },
  {
    "id": 49,
    "title": "Rebel's Stand",
    "requirements": ["City Rule: Demonic"],
    "global_achievements": ["Annihilation of Order"]
  },
  {
    "id": 50,
    "title": "Ghost Fortress",
    "requirements": ["City Rule: Demonic"],
    "anti_requirements": ["Annihilation of Order"],
    "global_achievements": ["City Rule: Militaristic"]
  },
  {
    "id": 51,
    "title": "The Void",
    "requirements": [
      "End of Corruption",
      "End of Corruption",
      "End of Corruption"
    ],
    "global_achievements": ["End of Gloom"]
  },
  {
    "id": 52,
    "title": "The Noxious Cellar",
    "personal_requirements": ["Seaker of Xorn"],
    "scenario_type": "personal",
    "new_locations": [53]
  },
  {
    "id": 53,
    "title": "Crypt Basement",
    "personal_requirements": ["Seaker of Xorn"],
    "scenario_type": "personal",
    "new_locations": [54]
  },
  {
    "id": 54,
    "title": "Palace of Ice",
    "personal_requirements": ["Seaker of Xorn"],
    "scenario_type": "personal"
  },
  {
    "id": 55,
    "title": "Foggy Thicket",
    "personal_requirements": ["Take Back the Trees"],
    "scenario_type": "personal",
    "new_locations": [56]
  },
  {
    "id": 56,
    "title": "Bandit's Wood",
    "personal_requirements": ["Take Back the Trees"],
    "scenario_type": "personal"
  },
  {
    "id": 57,
    "title": "Investigation",
    "personal_requirements": ["Vengeance"],
    "scenario_type": "personal",
    "new_locations": [58]
  },
  {
    "id": 58,
    "title": "Bloody Shack",
    "personal_requirements": ["Vengeance"],
    "scenario_type": "personal"
  },
  {
    "id": 59,
    "title": "Forgotten Grove",
    "personal_requirements": ["Finding the Cure"],
    "scenario_type": "personal",
    "new_locations": [60]
  },
  {
    "id": 60,
    "title": "Alchemy Lab",
    "personal_requirements": ["Finding the Cure"],
    "scenario_type": "personal"
  },
  {
    "id": 61,
    "title": "Fading Lighthouse",
    "personal_requirements": ["The Fall of Man"],
    "scenario_type": "personal",
    "new_locations": [62]
  },
  {
    "id": 62,
    "title": "Pit of Souls",
    "personal_requirements": ["The Fall of Man"],
    "scenario_type": "personal"
  },
  {
    "id": 63,
    "title": "Magma Pit",
    "scenario_type": "random"
  },
  {
    "id": 64,
    "title": "Underwater Lagoon",
    "scenario_type": "random"
  },
  {
    "id": 65,
    "title": "Sulfur Mine",
    "global_achievements": ["Ancient Technology"],
    "scenario_type": "random"
  },
  {
    "id": 66,
    "title": "Clockwork Cove",
    "global_achievements": ["Ancient Technology"],
    "scenario_type": "random"
  },
  {
    "id": 67,
    "title": "Arcane Library",
    "global_achievements": ["Ancient Technology"],
    "scenario_type": "random"
  },
  {
    "id": 68,
    "title": "Toxic Moor",
    "scenario_type": "random"
  },
  {
    "id": 69,
    "title": "Well of the Unfortunate",
    "scenario_type": "random"
  },
  {
    "id": 70,
    "title": "Chained Isle",
    "scenario_type": "random"
  },
  {
    "id": 71,
    "title": "Windswept Highlands",
    "scenario_type": "random"
  },
  {
    "id": 72,
    "title": "Oozing Grove",
    "scenario_type": "sealed"
  },
  {
    "id": 73,
    "title": "Rockslide Ridge",
    "scenario_type": "sealed"
  },
  {
    "id": 74,
    "title": "Merchant Ship",
    "requirements": ["High Sea Escort"],
    "scenario_type": "city"
  },
  {
    "id": 75,
    "title": "Overgrown Graveyard",
    "requirements": ["Grave Job"],
    "scenario_type": "city"
  },
  {
    "id": 76,
    "title": "Harrower Hive",
    "requirements": ["Bravery"],
    "scenario_type": "sealed"
  },
  {
    "id": 77,
    "title": "Vault of Secrets",
    "scenario_type": "sealed"
  },
  {
    "id": 78,
    "title": "Sacrifice Pit",
    "scenario_type": "city"
  },
  {
    "id": 79,
    "title": "Lost Temple",
    "requirements": ["Fish's Aid"],
    "scenario_type": "city"
  },
  {
    "id": 80,
    "title": "Vigil Keep",
    "scenario_type": "road"
  },
  {
    "id": 81,
    "title": "Temple of the Eclipse",
    "scenario_type": "city"
  },
  {
    "id": 82,
    "title": "Burning Mountain",
    "scenario_type": "road"
  },
  {
    "id": 83,
    "title": "Shadows Within",
    "requirements": ["Bad Business"],
    "scenario_type": "city"
  },
  {
    "id": 84,
    "title": "Crystalline Cave",
    "requirements": ["Tremors"],
    "scenario_type": "city"
  },
  {
    "id": 85,
    "title": "Sun Temple",
    "scenario_type": "road"
  },
  {
    "id": 86,
    "title": "Harried Village",
    "party_achievements": ["The Poison's Source"],
    "scenario_type": "city",
    "new_locations": [87]
  },
  {
    "id": 87,
    "title": "Corrupted Cove",
    "requirements": ["The Poison's Source"],
    "scenario_type": "city"
  },
  {
    "id": 88,
    "title": "Plane of Water",
    "requirements": ["Water-Breathing", "Water Staff"],
    "scenario_type": "city"
  },
  {
    "id": 89,
    "title": "Syndicate Hideout",
    "requirements": ["Sin-Ra"],
    "scenario_type": "city"
  },
  {
    "id": 90,
    "title": "Demonic Rift",
    "scenario_type": "road"
  },
  {
    "id": 91,
    "title": "Wild Melee",
    "scenario_type": "city"
  },
  {
    "id": 92,
    "title": "Back Alley Brawl",
    "requirements": ["Debt Collection"],
    "scenario_type": "city"
  },
  {
    "id": 93,
    "title": "Sunken Vessel",
    "requirements": ["A Map to Treasure"],
    "scenario_type": "city"
  },
  {
    "id": 94,
    "title": "Vermling Nest",
    "party_achievements": ["Through the Nest"],
    "scenario_type": "city",
    "new_locations": [95]
  },
  {
    "id": 95,
    "title": "Payment Due",
    "requirements": ["Through the Nest"],
    "scenario_type": "city"
  }
]