[{
    "id": 1,
    "title": "Black Barrow",
    "party_achievements": ["First Steps"],
    "new_locations": [2],
    "introduction": "The hill is easy enough to find-a short journey past the New Market Gate and you see it jutting out on the edge of the Corpsewood, looking like a rat under a rug. Moving closer you the mound is formed from a black earth. Its small, overgrown entrance presents a worn set of stone stairs leading down into the darkness.\nAs you descend, you gratefully notice light emanating from below. Unfortunately, the light is accompanied by the unmistakable stench of death.You contemplate what kind of thieves would make their camp in such a horrid place as you reach the bottom of the steps. Here you find your answer - a rough group of cutthroats who don't seem to have taken very kindly to your sudden appearance. One in the back matches the description of your quarry.\n\"Take care of these unfortunates,\" he says, backing out of the room.You can vaguely make out his silhouette as he retreats down a hallway and through a door to his left.\n\"Well, it's not every day we get people stupid enough to hand-deliver their valuables to us,\" grins one of the larger bandits, unsheathing a rusty blade.\"We'll be killing you now.\"\nJoke's on them. If you had any valuables, you probably wouldn't be down here in the first place.",
    "treasures": [7],
    "board_square": "G-10",
    "goal": "Kill all enemies",
    "conclusion": "With the last bandit dead, you take a moment to catch your breath and steel yourself against the visions of living remains ripping at your flesh. Your target is not among the dead, and you shudder to think what horrors still await you in the catacombs below. (2)",
    "tiles": ["L1a", "G1b", "I1b"],
    "event_1": {
      "text": "Kicking through the door, you find yourself face-to-face with the reason these bandits chose this particular hole to nest in: animate bones - unholy abominations of necromantic power.\nNothing more to do but lay them to rest along with the remainder of this troublesome rabble."
    }
  },
  {
    "id": 2,
    "title": "Barrow Lair",
    "requirements": ["First Steps"],
    "new_locations": [3, 4],
    "introduction": "The stench of death and rotting flesh gets thicker as you kick past the corpses of your foes and head deeper into the underground burial site. Guided by the muffled sounds of conversation, you find your way through the maze of crypts and burst into a small room full of hard-faced bandits, all with bows at the ready.\nThey're clearly guarding something. You must be in the right place.",
    "treasures": [67],
    "goal": "Kill the Bandit Commander and all revealed enemies",
    "conclusion": "Sifting through the carnage left by the battle, you find a cache at the back of the room containing the scrolls you were hired to collect. You can't help but rifle through them a bit, but find that the writing upon them is in some unknown archaic language. One thing that does jump out at you, however, is a map of the northern countryside. A bend in the Still River is clearly marked as a point of interest. Contemplating whether you want to find out more about this so-called \"Gloom,\" you decide that the spot could be a point of interest for you, as well. (4)\nBut that can be forgotten for the moment. You pack up the papers and head back to Gloomhaven to collect your reward.\nMeeting Jekserah once again at the Sleeping Lion, you hand over the papers and are paid the agreed-upon amount.\n\"You know,\" she whispers to you softly under the bustle of the tavern. \"If you're interested, I may have another job for you. A tribe of Inox in the Dagger Forest has ransacked a couple of my caravans headed to the Capital.\"\n\"I told the militia, but they do nothing,\" she spits. \"I can point you in the direction of their encampment. If you can make an example of them, I will pay you even more.\"\nShe places a crude map of the forest on the table and stands up, her jewelry clinking with the movement. \"Come find me when it is done.\" (3)",
    "board_square": "G-11",
    "event_1": {
      "text": "You open the door to a large crypt littered with coffins. At the back stands your quarry. He fits the description, but there is something previously unnoticed in his eyes - a dark otherworldly force.\n\"Who are you to think you can interrupt the work of the Gloom?\" A dark energy engulfs his hands as he speaks. \"I will show you what you are dealing with!\"",
      "boss_special_1": "The Bandit Commander immediately jumps into a door hex, regardless of how far away it is, and opens it, revealing the adjacent room. Starting with (a), the Bandit Commander jumps to a door in the order of (a), (b), (c), (d), and then back to (a).",
      "boss_special_2": "The Bandit Commander summons one normal Living Bones for two characters or one elite Living Bones for three of four characters.",
      "special_rules": "Doors (a), (b), (c), and (d) are locked and can only be opened by the Bandit Commander."
    },
    "rewards": ["10 gold each", "+1 prosperity"],
    "special_rules": "Add three CURSE cards to each character's attack modifier deck as a scenario effect",
    "tiles": ["B3b", "M1a", "A1a", "A2a", "A3b", "A4b"]
  },
  {
    "id": 3,
    "title": "Inox Encampment",
    "anti_requirements": ["The Merchant Flees"],
    "party_achievements": ["Jekserah's Plans"],
    "new_locations": [8, 9],
    "treasures": [65],
    "board_square": "G-3",
    "goal": "Kill a number of enemies equal to five times the number of characters",
    "introduction": "So this merchant wants to make an example of some caravan raiders? Seems reasonable enough. For the right amount of money, almost anything can be made reasonable.\nYou enter the Dagger Forest and begin to track down the encampment using Jekserah's crude map. It is well-hidden, but following the signs outlined on the parchment, you find a dense cluster of huts in a small clearing of the forest. All that's left is to head in and make that requested example.",
    "conclusion": "Running through the forest, fleeing the smell of burning flesh, you now find more than enough opportunity to contemplate your actions.\nHow your actions sit with you must be visible on your face as you meet once more with Jekserah, this time in her manor. She hands you a sack of coins with a frown.\n\"They were thieves and murderers, \"she says blankly.\"They deserved what you gave them. And that is all I will say of the matter.I have one more task I would like you to perform.I require a diamond of considerable size for a customer, but I cannot find one anywhere in the city.\"\n\"There is a diamond mine, however, in the southern mountains long since lost to the wilderness. I've heard reports that it is now overrun with Vermlings, no doubt with some other more intelligent force behind them.If you can fight your way in and grab the biggest diamond you can find, I will give you a considerable reward.(9)\"\n\"Now leave me in peace.\"Jekserah's two massive Inox bodyguards step forward, directing you to leave the manor.\nOutside, contemplating your new task, you hear a small voice behind you.\"She's not looking for profit, you know.\"\nYou turn around to see a female Quatryl step out of the alley beside Jekserah's house.She's clad in dark leather armor and holds a conspicuous contraption full of whirring gears and topped with a conical metal piece connected to a tube.\n\"Argeise, city guard, \"she says, introducing herself. \"I know, I don't exactly look the part, but if anyone isn't what they appear to be, it's that Valrath you've been talking to. Sure, she's a merchant, but she's up to something far more sinister.\"\n\"She's been trying to overthrow the military in Gloomhaven for as long as I've been here, and we're all very curious about what her current machinations are.\"\n\"Look, you can go do her bidding like a good little puppy if you want, but if you'd rather actually help this town keep the peace and not get overrun by the wilds, I have a different idea. We'll get to the bottom of Jekserah's plans and expose her for who she really is.\"(8)",
    "special_rules": "Until door (1) is opened, one normal Inox Guard spawns at (a) at the end of every odd round for two characters of the beginning of every round for three or four characters.",
    "event_1": {
      "text": "You push your way into the back cave only to be faced with a half-dozen crying, screaming Inox children. You have little opportunity to contemplate the implications of this development, however, as you find yourself also staring down the bows of several Inox archers. Your only option is to continue fighting."
    },
    "rewards": ["15 gold each", "+1 prosperity"],
    "tiles": ["L1b", "L3a", "B1a", "B2a", "B3a", "B4a", "E1b"]
  },
  {
    "id": 4,
    "title": "Crypt of the Damned",
    "new_locations": [5, 6],
    "introduction": "The bandit commander's proclamations of a \"Gloom\" do not sit well in your stomach as you search the bend in the Still River - something here holds an interest for these maniacs.\nYou are somewhat surprised to find the ruins of an ancient crypt half - covered in moss and ivy.The history of this place is old and dark.With no other information to go on, you head down into the depths.Whatever these supposed bandits are up to, you're determined to find out, even after you stumble across a large group of them and more animated dead at the bottom of the stairs.\n\"You've made a mistake coming here\" one of the bandits hisses. You disagree. You are right where you want to be.",
    "treasures": [38, 46],
    "goal": "Kill all enemies",
    "conclusion": "It is clear that you have disrupted some sort of ritual here. These elemental demons belong on an entirely different plane of existence, but the cultists have somehow managed to pull them through to this one.\nOn the altar in the back room, there is a wealth of scribblings on these rituals. Not all the writing is intelligible, but you get the sense that this crypt is a place of power once used by an ancient civilization. The ancients tapped the power of the elements to enhance their own lives, and while their exact fate is beyond your knowledge, it clearly didn't end well.\nAmong the scripts you also find notes on a couple of other places of power in the area.One appears to see heavy use with the cult and the other is marked as being overrun by vicious undead.It looks as though you have opportunities to either disrupt more of their work(5) or get in their good graces by helping to clear out a threat.(6)",
    "board_square": "E-11",
    "event_1": {
      "text": "You bash in the door, thinking you are prepared for anything. Before you, however, stands a creature of pure elemental energy, enraged and demonic. It takes you a second to collect yourself. As if animating the dead wasn't enough for these lunatics."
    },
    "tiles": ["E1a", "G1b", "C1a", "M1a"]
  },
  {
    "id": 5,
    "title": "Ruinous Crypt",
    "new_locations": [10, 14, 19],
    "goal": "Kill all enemies",
    "introduction": "Your mission is clear. These elemental cultists are distorting the fabric of the world and must be stopped. With that goal in mind, you follow the writings to an ancient crypt you believe to be the cult's base of operations. Steeling yourselves for combat, you batter through the rotted door and charge into the hall of the crypt.\nThe sight before you is both wondrous and horrifying.A group of cultists is performing ritual incantations in front of a black, gaping hole in reality.They turn toward you and snarl, unsheathing their sacrificial daggers. Behind them an inky darkness spills forth from the hole and coalesces into nightmarish forms full of teeth and claws.You know you must send these terrors of the elemental plane back into the void, but you are paralyzed with fear.",
    "conclusion": "With the cultists and their minions dead, it seems the dark rift is now dormant. It is no less disconcerting, however. You toss a rock at it, and the rock disappears into nothingness. You must admit that you wonder whether you could enter the rift yourself and whether you could survive the trip to wherever that rock ended up. (10)\nAlternately, finding some way to close the rift is probably the more prudent decision.There is an Aesther enchanter in Gloomhaven who may know more about this inter - planar stuff.She's been known to ask for impossible favors before she helps anyone, though.(14)(19)",
    "treasures": [4, 28],
    "board_square": "D-6",
    "special_rules": "All characters start with DISARM as a scenario effect.",
    "tiles": ["M1a", "K1a", "K2b"]
  },
  {
    "id": 6,
    "title": "Decaying Crypt",
    "party_achievements": ["Jekserah's Plans", "Dark Bounty"],
    "new_locations": [8],
    "treasures": [50],
    "goal": "Reveal the M tile and kill all revealed enemies",
    "introduction": "What is life without a little bit of intrigue? The cultists have clearly marked this crypt as a spot of trouble for them. Perhaps clearing the place out will put you in their good graces. Or maybe you're just hoping to find a big stash of treasure, untouched by looters' hands.\nOnce you arrive, the smell makes you regret your decision more than anything else. It's not the fact that you've had it about up to here with exploring old decrepit ruins. It's not the undead horrors shambling and moaning in the shadows. It's the smell.The smell of death and soullessness and rotting flesh.",
    "conclusion": "After the terrible shrieks and moans of the undead, the sound of someone clapping is at once foreign and alarming. Turning around, you see a hooded figure standing at the edge of your torchlight. You raise your weapon, but the grin on his silhouetted face isn't menacing in a way that calls for arms. It is menacing in a way you've never experienced before.\n\"Well done, sirs, \"the figure lilts. \"My, my, but you do have a way about you, don't you? And you've certainly gotten our attention now, removing this troublesome crypt of its rogue undead element.We very much prefer our undead to be the controllable variety, now don't we?\"\nThere is a long pause as the figure stares at you, still grinning.\n\"Well, perhaps you'd be so kind as to do us another favor? After which we'll be mostly settled on the whole issue of you murdering some of my brethren.\" He stops grinning.\n\"There's a necromancer in Gloomhaven. Been giving us a spot of trouble, sending mercenaries out to do her dirty work against us. Maybe you've met her.\"\n\"Kill Jekserah. Bring her head to our headquarters, and we'll see about letting you live.\"(8)",
    "board_square": "F-10",
    "special_rules": "Add three CURSE cards to each character's attack modifier deck as a scenario effect",
    "tiles": ["L1a", "K1a", "K2b", "M1a"],
    "rewards": ["5 gold each"]
  },
  {
    "id": 7,
    "title": "Vibrant Grotto",
    "requirements": ["The Power of Enhancement", "The Merchant Flees"],
    "new_locations": [20],
    "board_square": "C-12",
    "goal": "Loot all treasure tiles",
    "introduction": "You gingerly step into the entryway of the Crooked Bone, careful to avoid the broken glass, nails, and other treacherous things. You glance around the room and see nothing but the usual detritus. Before you can call out to Hail, though, an explosion from an upper room violently shakes the entire building.\n\"Damn it all to the abyss!\" Hail's disembodied voice yells out.\"I set up my work in the most out-of-the-way, uninviting, decrepit little hovel, and grand idiots still manage to stumble in and disrupt my research.\"\n The translucent woman suddenly appears before.\"You do know that your mere presence in this building changes the flow of the ether, causing unanticipated currents that produce catastrophic consequences, right? I mean, how could you not know that ?\"\nHail closes her eyes and begins to take deep breaths, fading a little out of view with each exhale.\"Yes, I did agree to help you.I had hoped the memory was a nightmare of some kind, but it wasn't, so that can't be helped now.The least you can do inreturn, however, is to warn me before you cross the threshold.\"\nShe gives you an icy stare.\"So what do you want, anyway? Let' s make this quick.\" You explain to her the situation with Jekserah and the need to locate where she is hiding.\n\"Ah, a simple scrying matter? Well then, we are in luck, \" Hail begins. \"Or rather, I' m in luck.The main component I would need for such a task is biteroot, and I ran out of it just last week.I was going to gather more, but now I can just send you out to get it instead. Everyone wins!Except those infernal forest imps who terrorize my usual gathering spot. I hope quite a few of them will end up dead.\"\nA small map drops in your hand, and, with a wave of Hail's arms, a sudden, powerful force pushes you out the door.\"Remember: ring the bell when you come back and wait fortyseven seconds before entering the door!\"\nYou are able to follow the map to a network of small caves just north of the Dagger Forest.The place is teeming with life: lush, massive plants, as well as a number of hostile animals and imps.You prepare for their attack.",
    "special_rules": "The treasure tiles can only be looted using a Loot action. They cannot be looted by normal end-of-turn looting.",
    "tiles": ["M1b", "D2b", "C2a", "G2a", "F1b", "B4b"],
    "conclusion": "You pull up the last bush and hack away at its root. The grotto is still alive with many hostile creatures, but with your packs now full of biteroot, you make a quick retreat, eventually finding your way to the Stone Road and back to Gloomhaven and the Crooked Bone.\nYou ring the bell and wait a good minute before entering the slanted doorway. There's no sign of Hail, so you call out and wait for her. It takes much longer than you'd like.\nWhen she finally does appear on the other side of the ruined bar counter, she seems genuinely surprised to see you. \"Is that biteroot you have there? Ha, imagine that, I was just thinking about going to get some, seeing as I just ran out last week.\"\nYou stare at one another in confusion.\n\"Oh, I sent you to get that, didn't I?\" Hail scratches her head. \"Right, scrying. I remember now. Hand over the root.\"\nYou give her the packs full of biteroot. \"What were the details again? Jekserah? Valrath woman, yay high? Merchant dabbling in necromancy? Wears a red cape and lots of gold jewelry? Shouldn't be too hard.\"\nHail disappears with the root and you begin to hear a faint banging coming from the floor above you.\nEventually Hail appears before you holding a parchment covered in a thick, gooey biteroot paste. \"There you go. Just follow that, and you should find your way to where she's hiding.\"You hesitantly take the map. \"I could have cleaned off the paste, but I thought it added a bit of charm.\" (20)"
  },
  {
    "id": 8,
    "title": "Gloomhaven Warehouse",
    "requirements": ["Jekserah's Plans"],
    "anti_requirements": ["The Dead Invade"],
    "global_achievements": ["The Merchant Flees"],
    "new_locations": [7, 13, 14],
    "treasures": [51],
    "board_square": "C-18",
    "introduction": "At the behest of your mysterious contact, you sneak towards Jekserah's warehouse under the cover of night. With any luck, you'll be able to uncover her plans an put a stop to them.\nHoping to find the warehouse largely abandoned, you instead discover that it is teeming with undead. At least that gives you a better idea of her plans. She's clearly been using the necromantic scroll you delivered to raise the undead within the city walls, and now it is time to put them back to rest.",
    "goal": "Kill both Inox Bodyguards",
    "event_1": {
      "text": "Barreling through the gauntlet of storage shelves, traps, and undead, you finally make it to the back room of the warehouse, face-to-face with Jekserah and her two Inox bodyguards.\n\"So, you've decided to disrupt my plans instead of help me? You will regret that decision when I return to Gloomhaven with a legion of undead at my back!\"\nMoving with great speed, Jekserah turns and runs from you, flipping out a window. You make a move to pursue her, but the two gargantuan Inox block your advance."
    },
    "conclusion": "With the battle behind you, you look out the window and see no evidence of the fleeing Valrath. You've stopped her plans for now, but after your brief conversation, it is clear you need to hunt her down before she can make good on her threats. (13)\n\"She's beyond my network, \"the city guard Argeise says with a shrug when you ask her later. \"We'd like to make sure she won't cause more trouble, but she's fled the city, and I'm not about to go traipsing through the wilds.\"\n\"You might have more luck with the Aesther enchanter in town, \"she suggests. \"She can surely divine the coward's location for you, if you can get her to cooperate.\"(14)(7)",
    "rewards": ["+2 reputation"],
    "tiles": ["I1a", "I2b", "G2b"]
  },
  {
    "id": 9,
    "title": "Diamond Mine",
    "anti_requirements": ["The Merchant Flees"],
    "global_achievements": ["The Dead Invade"],
    "new_locations": [11, 12],
    "board_square": "L-2",
    "goal": "Kill the Merciless Overseer and loot the treasure tile",
    "introduction": "Ignoring Argeise's warnings, you head to the diamond mine. \"Sinister machinations\" is, of course, a troubling phrase to throw around, but the phrase \"considerable reward\" trumps that in a heartbeat.\nHeading into the damp underground cavern, you were expecting to find a few scraggly Vermlings to make easy work of. You certainly weren't expecting a pack of vicious hounds guarding the entrance. Finding this diamond may prove more difficultly that originally anticipated.",
    "rewards": ["20 gold each", "+1 prosperity"],
    "event_1": {
      "text": "You move through a tight crawlspace clearly more suited to the ratlike Vermlings into a large chamber full of rubble and Vermling miners on high alert. Toward the back of the chamber, a man in a dark robe cracks a whip and begins spitting orders at the miners, who turn their pickaxes away form the stone walls and toward you.",
      "boss_special_1": "All Vermling Scouts immediately take an extra turn using the action card drawn for them this round.",
      "boss_special_2": "The Merciless Overseer summons two normal Vermling Scouts for two characters, one normal and one elite Vermling Scout for three characters, or two elite Vermling Scouts for four characters."
    },
    "conclusion": "With the overseer dead and the diamond in hand, you head back to Jekserah to claim your reward. Her bodyguards escort you inside the manor where you find her somehow different - more harrowed and grim.\n\"Wonderful.\" She exchanges the diamond for a large purse full of coins. \"This will serve beautifully as a focus for the incantations. I wonder if the cultists even knew what they had here. With this, I can summon an entire army of undead!\"\nShe turns to you with a strange glint in her eye. \"So then! Are you ready to overthrow the military of Gloomhaven and put control of the city into the hands of the Merchant's Guild? (11) Or do you not have the stomach to effect real change? (12)",
    "tiles": ["I2a", "N1a"]
  },
  {
    "id": 10,
    "title": "Plane of Elemental Power",
    "anti_requirements": ["The Rift Neutralized"],
    "party_achievements": ["A Demon's Errand"],
    "new_locations": [21, 22],
    "tiles": ["D1b", "G1a", "L1b", "L3a"],
    "goal": "Kill all enemies",
    "board_square": "C-7",
    "introduction": "Your vision shifts and blurs around you. Nightmarish wailing pierces your ears. You feel your extremities stretching out, as if the universe is trying to tear you apart.\nAnd then it stops. You open your eyes to see your feet are on solid ground, but around you whirls strange elemental energies - fie mixing with ice in torrential power. You catch your breath and glance back, relieved to see a void of darkness similar to the one that brought you to this place.\nThe relief is short-lived, however, as a booming voice fills the crackling air. \"Who are you to slay my servants and invade my realm? This affront will not go unpunished!\"\nBefore you the energies in the air begin to form vague demonic shapes. To go deeper into this unearthly place, you must fight your way through.",
    "conclusion": "As the final demon in sight screams and dissipates into the wind, you fall to your knees, thankful that the assault has stopped.\n\"Very interesting.\" The voice appears deep inside your head, clawing at your brain with its words. \"You interlopers are unexpectedly powerful. I could certainly use your expertise to find something in your own plane.\"\nThe red rock below you rumbles and cracks, and a fiery fissure opens at your feet. \"I open my realm to you. Come, let me speak to you face-to-face.\"\nHaving already made one leap of faith this day, you decide there's no harm in making another. The heat grows more intense as you descend, and scalding air billows up from below, slowing your fall. You land quite safely in what appears to be an underground temple. Before you stands a monstrous creature, horned and terrifying, holding a trident and standing on four hooved legs.\nThe voice still resonates from inside your head. \"Brave and foolish. You should serve me well. There is an artifact of great power located in a forgotten temple along the Serpent's Kiss River. You can retrieve it for me, (22) or you can die here and now.\" (21)"
  },
  {
    "id": 11,
    "title": "Gloomhaven Square A",
    "anti_requirements": ["End of the Invasion"],
    "global_achievements": ["City Rule: Economic", "End of the Invasion"],
    "board_square": "B-16",
    "new_locations": [16, 18],
    "tiles": ["D1a", "H1b", "L1a", "L2b", "E1a"],
    "goal": "Kill the Captain of the Guard",
    "introduction": "Jekserah's plan is troubling, but it is certainly sound in some dark, twisted sense. You've seen the guards on the wall. They can barely fight back the Vermlings, and their taxation is strangling the town and your own pocket.\nWith an army of undead, the merchants can govern the city into an age of prosperity and keep it safe from the forces outside the walls.\n\"So are you ready to take the fate of this city into your own hands, mercenaries?\"\nYou nod in assent. \"My army is ready. We march for the Ghost Fortress!\" A commotion in the foyer startles you away from Jekserah's rally. Rushing into the room, you see a troop of solider standing over the bodies of Jekserah's Inox guards.\n\"This ends now!\" Argeise points a crossbow at you. \"I tried to warn you. Do you have any idea what you are unleashing on the city?\"\n\"It's too late,\" Jekserah spits from behind you, \"They can't stop us! My army has already dispersed into the city. It will only grow with every guard who falls.\"\nJekserah turns to you. \"Head to the Ghost Fortress. If the Captain of the Guard falls, any resistance to our new order will fall soon after.\"",
    "special_rules": "All Living Bones and Living Corpses are allies to you and enemies to all other monster types.",
    "rewards": ["15 gold each", "-2 reputation", "+2 prosperity", "\"Skullbane Axe\" design (Item 113)"],
    "event_1": {
      "text": "With the guards' bodies in your wake stirring and rising as the undead, you knock through the fortress door. \"Today we stand against the darkness!\" The Captain of the Guard bellow at you, surrounded by soldiers. \"To me! I will not let the city fall to this scum!\""
    },
    "conclusion": "The last of the guard falls, and once more you see a transformation of the bodies into soulless walking corpses. Jekserah steps through the doorway behind you.\n\"You have done well, mercenaries-proved yourself in the face of these relentless pigs. With my bodyguards dead, you will be my new right hand, and we will rule over this city as it was meant to be ruled over. The last remnants of the old empire has finally fallen, and you should be proud.\"\n\"But there is still much work to be done. The merchant guild grows concerned about the declining quality of our water supply. We feel there may be some dark force at work below the sewers, poisoning the city. (18) I've also heard some talk behind closed doors of a dragon making roost in the Copperneck Mountains. Some merchants can be such children, but still, the reports are worth investigating. Whatever it is could be a threat to the city.\" (16)"
  },
  {
    "id": 12,
    "title": "Gloomhaven Square B",
    "board_square": "B-16",
    "anti_requirements": ["End of the Invasion"],
    "global_achievements": ["End of the Invasion"],
    "new_locations": [16, 18, 28],
    "goal": "Kill Jekserah",
    "introduction": "As Jekserah outlines her plan, you find yourself slowly backing out of the room. Protecting this city with an army of undead is madness. You cannot give over all the power to an unscrupulous necromancer.\nIn mid sentence, Jekserah looks up at you and stops. \"What is the matter?\" She frowns. \"Are you losing your nerve here at the end? You've already killed so many in my service. What is just a few more?\"\nYou quickly turn and run for the door. Her army is too massive to take on without help.\n\"Foolish mercenaries,\" she laughs behind you. \"I thought you'd want to join me in this new venture, but if you'd rather die like the rest of the military scum, that can be arranged!\"\nYou race through Gloomhaven Square to the Ghost Fortress. Guards stop you at the gate and you hurriedly explain the threat looming behind you. Frantically you push past them, looking for the Captain of the Guard.\n\"This is truly troubling,\" the Captain says after you quickly outline Jekserah's plan. \"We must move against this necromancer immediately!\" The sound of steel on steel reverberates through the room, followed by the yells and screams of the guard outside.\n\"They are upon us!\" The doors bust open and the decaying shapes of the living dead stream into the room. \"To arms! Fight them back!\"",
    "event_1": {
      "text": "The waves of undead crashing against your weapons have finally subsided as you reach Jekserah's manor and kick in the door. You see her in the foyer, shaking with rage.\n\"You will not defeat me! My army has been cut back, but the dead are fuel to my fire. My army is infinite and eternal!\"",
      "boss_special_1": "Jekserah summons two normal Living Bones for two characters, one normal and one elite Living Bones for three characters, or two elite Living Bones for four characters.",
      "boss_special_2": "This is the same as Boss Special 1, except that Living Corpses are summoned instead of Living Bones."
    },
    "special_rules": "All City Guards and City Archers are allies to you and enemies to all other monster types.",
    "conclusion": "Jekserah collapses, the life fleeing her eyes. \"I...\" she whispers at you. \"You have no idea what's coming...\" (28)\n\"Infuriating. \"The Captain of the Guard steps up behind you, wiping his blade on his tunic. \"So much needless death, eating ourselves from the inside. At least it is over now.\"\nHe looks from Jekserah's lifeless corpse to you. \"Listen, you have proven yourself this day. Without your warning and without your strength, we would have been overtaken by the undead. If you're interested, I may have some more work for you.\n\"First of all, we've had reports from the north about large flying creatures. People are afraid of dragons.\" He shakes his head in annoyance. \"I'd like you to head to the northern pass and investigate. (16)\n\"Closer to home, however, there is some trouble brewing in the sewers below the Sinking Market. The wells in the area seem to be poisoned, and the sewers have become infested with snakes and sentient slimes, making further investigation difficult. I need you to discover the source of the poison.\" (18)",
    "rewards": ["+4 reputation", "\"Skullbane Axe\" design (Item 113)"],
    "tiles": ["E1a", "L2b", "L1a", "H1b", "D1a"]
  },
  {
    "id": 13,
    "title": "Temple of the Seer",
    "global_achievements": ["End of the Invasion"],
    "new_locations": [15, 17, 20]
  },
  {
    "id": 14,
    "title": "Frozen Hollow",
    "global_achievements": ["The Power of Enhancement"],
    "board_square": "C-10",
    "goal": "Kill all enemies",
    "special_rules": "Add three -1 cards to each character's attack modifier deck as a scenario effect",
    "tiles": ["K1b", "K2a", "I2a"],
    "introduction": "An enchanter has been called for, so an enchanter must be found.\nFollowing reports of an Aesther in the Boiler District, you find yourself standing before an abandoned and decrepit tavern: the Crooked Bone. Opening the door, the inside looks exactly as the outside advertised: spiderwebs, splintered stools, and dusty, broken glass.\nStepping pas the threshold, a translucent female suddenly appears before you. \"Why have you come to this place, mercenaries? Your presence is unwanted, and you are disrupting my research.\"\nYou quickly explain why you have come and the woman's frown deepens.\n\"'Oh, look at the Aesther woman. She can fulfill all our wishes. All she has to do is wave her hands and our wildest dreams will come true.'\" She sights in frustration and actually does wave her hands. \"Leave me in peace.\"\nYou don't move. She stares.\n\"Well, instead of disrupting, then maybe you could help. Scratch my back, maybe I'll scratch yours. That's how these things work, right?\" The Woman turns and walks towards a destroyed set of stairs, but after a few steps, she fades away entirely.\n\"I need an orb from the Frozen Hollow in the Copperneck Mountains.\" The woman's voice comes from directly in front of you, as if she hadn't moved at all. \"Bring it back to me and I may help you.\"\nA map drops at your feet. \"My name is Hail by the way. Do not come back without the orb.\"\nThe map is easy to follow. Deep in the Copperneck Mountains, obscured by snow drifts, you find the opening to a dark, narrow cave. The wolf tracks around the entrance are troubling, but, with a firm resolve, you enter.",
    "conclusion": "With the last of your adversaries dead, you approach the back of the chamber, where a small blue sphere floats above the floor. You slowly reach out your hand and find the orb cold to the touch. With a firm grip on it, the temperature is almost unbearable, but you quickly stash it into your pack and make your way back to the Crooked Bone.\nYou enter the abandoned tavern and call out to Hail. With no response, you wander around, observing the chaotic mess around you. You wonder how she gets any work done in this environment. As you approach the counter, Hail appears before you, holding the orb.\n\"Very interesting.\" She doesn't seem to notice you at all. \"A rift in our plane, somehow contained within a spherical barrier. Good thing you didn't break this on your way back. You easily could have been sucked into a realm of pure frost and been frozen solid before you had time to breathe. Or something worse could have happened.\n\"It's just so confounding. Who would have the power to do this?\" Hail takes a step to the left and disappears again.\nYou wait for what feels like hours, refusing to sit on the few stools that haven't yet fallen apart. You call out occasionally, but receive no response.\n\"Oh, you're still here.\" You turn around to see Hail in the middle of the room. \"Good, I'd like to experiment on you if it's all right.\" She reaches out to you and you stumble backward, falling over a table that splinters into hundreds of pieces.\n\"Oh, don't be a baby about it. I'm pretty sure it will end well.\"\nHail explains that she wants to try to bring forth raw power from another plane and contain it in a small orb that could give enhanced powers to anyone possessing it. The containment process, however, requires a lot of gold metal.\n\"Now that you have helped me in my endeavors, I suppose I should return the favor,\" Hail sighs. \"So what was it exactly that you wanted?\" (7) (19) (31) (43)"
  },
  {
    "id": 15,
    "title": "Shrine of Strength"
  },
  {
    "id": 16,
    "title": "Mountain Pass",
    "new_locations": [24, 25]
  },
  {
    "id": 17,
    "title": "Lost Island"
  },
  {
    "id": 18,
    "title": "Abandoned Sewers",
    "new_locations": [14, 23, 26, 43]
  },
  {
    "id": 19,
    "title": "Forgotten Crypt",
    "requirements": ["The Power of Enhancement"],
    "party_achievements": ["Stonebreaker's Censor"],
    "new_locations": [27]
  },
  {
    "id": 20,
    "title": "Necromancer's Sanctum",
    "requirements": ["The Merchant Flees"],
    "new_locations": [16, 18, 28]
  },
  {
    "id": 21,
    "title": "Infernal Throne",
    "anti_requirements": ["The Rift Neutralized"],
    "global_achievements": ["The Rift Neutralized"],
    "conditional_achievements": ["Artifact: Recovered"]
  },
  {
    "id": 22,
    "title": "Temple of the Elements",
    "requirements": ["A Demon's Errand"],
    "alt_requirements": ["Following Clues"],
    "global_achievements": ["Artifact: Recovered"],
    "new_locations": [31, 35, 36]
  },
  {
    "id": 23,
    "title": "Deep Ruins",
    "requirements": ["The Power of Enhancement"],
    "party_achievements": ["Through the Ruins"],
    "global_achievements": ["Ancient Technology"],
    "new_locations": [26]
  },
  {
    "id": 24,
    "title": "Echo Chamber",
    "party_achievements": ["The Voice's Command"],
    "new_locations": [30, 32]
  },
  {
    "id": 25,
    "title": "Icecrag Ascent",
    "party_achievements": ["The Drake's Command"],
    "new_locations": [33, 34]
  },
  {
    "id": 26,
    "title": "Ancient Cistern",
    "requirements": ["Water-Breathing"],
    "alt_requirements": ["Through the Ruins"],
    "party_achievements": ["Following Clues"],
    "new_locations": [22]
  },
  {
    "id": 27,
    "title": "Ruinous Rift",
    "requirements": ["Stonebreaker's Censor"],
    "anti_requirements": ["Artifact:Lost"],
    "global_achievements": ["The Rift Neutralized"]
  },
  {
    "id": 28,
    "title": "Outer Ritual Chamber",
    "requirements": ["Dark Bounty"],
    "party_achievements": ["An Invitation"],
    "new_locations": [29]
  },
  {
    "id": 29,
    "title": "Sanctuary of Gloom",
    "requirements": ["An Invitation"],
    "global_achievements": ["The Edge of Darkness"]
  },
  {
    "id": 30,
    "title": "Shrine of the Depths",
    "requirements": ["The Voice's Command"],
    "party_achievements": ["The Scepter and the Voice"],
    "new_locations": [42]
  },
  {
    "id": 31,
    "title": "Plane of Night",
    "requirements": ["The Power of Enhancement", "Artifact: Recovered"],
    "global_achievements": ["Artifact: Cleansed"],
    "new_locations": [37, 38, 39, 43]
  },
  {
    "id": 32,
    "title": "Decrepit Wood",
    "requirements": ["The Voice's Command"],
    "new_locations": [33, 40]
  },
  {
    "id": 33,
    "title": "Savvas Armory",
    "requirements": ["The Voice's Command"],
    "alt_requirements": ["The Drake's Command"],
    "party_achievements": ["The Voice's Treasure", "The Drake's Treasure"]
  },
  {
    "id": 34,
    "title": "Scorched Summit",
    "requirements": ["The Drake's Command"],
    "anti_requirements": ["The Drake Aided"],
    "lost_achievements": ["The Drake's Command"],
    "global_achievements": ["The Drake Slain"]
  },
  {
    "id": 35,
    "title": "Gloomhaven Battlements A",
    "requirements": ["A Demon's Errand"],
    "anti_requirements": ["The Rift Neutralized"],
    "lost_achievements": ["A Demon's Errand"],
    "global_achievements": ["City Rule: Demonic", "Artifact: Lost"],
    "new_locations": [45]
  },
  {
    "id": 36,
    "title": "Gloomhaven Battlements B",
    "requirements": ["A Demon's Errand"],
    "anti_requirements": ["The Rift Neutralized"],
    "lost_achievements": ["A Demon's Errand"],
    "global_achievements": ["The Rift Neutralized"]
  },
  {
    "id": 37,
    "title": "Doom Trench",
    "requirements": ["Water-Breathing"],
    "party_achievements": ["Through the Trench"],
    "new_locations": [47]
  },
  {
    "id": 38,
    "title": "Slave Pens",
    "party_achievements": ["Redthorn's Aid"],
    "new_locations": [44, 48]
  },
  {
    "id": 39,
    "title": "Treacherous Divide",
    "party_achievements": ["Across the Divide"],
    "new_locations": [15, 46]
  },
  {
    "id": 40,
    "title": "Ancient Defense Network",
    "requirements": ["The Voice's Command", "The Voice's Treasure"],
    "global_achievements": ["Ancient Technology"],
    "new_locations": [41]
  },
  {
    "id": 41,
    "title": "Timeworn Tomb",
    "requirements": ["The Voice's Command"],
    "global_achievements": ["The Voice Freed"]
  },
  {
    "id": 42,
    "title": "Realm of the Voice",
    "requirements": ["The Scepter and the Voice"],
    "anti_requirements": ["The Voice Freed"],
    "lost_achievements": ["The Voice's Command"],
    "global_achievements": ["The Voice Silenced"]
  },
  {
    "id": 43,
    "title": "Drake Nest",
    "requirements": ["The Power of Enhancement"],
    "global_achievements": ["Water-Breathing"]
  },
  {
    "id": 44,
    "title": "Tribal Assault",
    "requirements": ["Rethorn's Aid"]
  },
  {
    "id": 45,
    "title": "Rebel Swamp",
    "requirements": ["City Rule: Demonic"],
    "new_locations": [49, 50]
  },
  {
    "id": 46,
    "title": "Nightmare Peak",
    "requirements": ["Across the Divide"],
    "global_achievements": ["End of Corruption"],
    "new_locations": [51]
  },
  {
    "id": 47,
    "title": "Lair of the Unseeing Eye",
    "requirements": ["Through the Trench"],
    "global_achievements": ["End of Corruption"],
    "new_locations": [51]
  },
  {
    "id": 48,
    "title": "Shadow Weald",
    "requirements": ["Redthorn's Aid"],
    "global_achievements": ["End of Corruption"],
    "new_locations": [51]
  },
  {
    "id": 49,
    "title": "Rebel's Stand",
    "requirements": ["City Rule: Demonic"],
    "global_achievements": ["Annihilation of Order"]
  },
  {
    "id": 50,
    "title": "Ghost Fortress",
    "requirements": ["City Rule: Demonic"],
    "anti_requirements": ["Annihilation of Order"],
    "global_achievements": ["City Rule: Militaristic"]
  },
  {
    "id": 51,
    "title": "The Void",
    "requirements": [
      "End of Corruption",
      "End of Corruption",
      "End of Corruption"
    ],
    "global_achievements": ["End of Gloom"]
  },
  {
    "id": 52,
    "title": "The Noxious Cellar",
    "personal_requirements": ["Seaker of Xorn"],
    "scenario_type": "personal",
    "new_locations": [53]
  },
  {
    "id": 53,
    "title": "Crypt Basement",
    "personal_requirements": ["Seaker of Xorn"],
    "scenario_type": "personal",
    "new_locations": [54]
  },
  {
    "id": 54,
    "title": "Palace of Ice",
    "personal_requirements": ["Seaker of Xorn"],
    "scenario_type": "personal"
  },
  {
    "id": 55,
    "title": "Foggy Thicket",
    "personal_requirements": ["Take Back the Trees"],
    "scenario_type": "personal",
    "new_locations": [56]
  },
  {
    "id": 56,
    "title": "Bandit's Wood",
    "personal_requirements": ["Take Back the Trees"],
    "scenario_type": "personal"
  },
  {
    "id": 57,
    "title": "Investigation",
    "personal_requirements": ["Vengeance"],
    "scenario_type": "personal",
    "new_locations": [58]
  },
  {
    "id": 58,
    "title": "Bloody Shack",
    "personal_requirements": ["Vengeance"],
    "scenario_type": "personal"
  },
  {
    "id": 59,
    "title": "Forgotten Grove",
    "personal_requirements": ["Finding the Cure"],
    "scenario_type": "personal",
    "new_locations": [60]
  },
  {
    "id": 60,
    "title": "Alchemy Lab",
    "personal_requirements": ["Finding the Cure"],
    "scenario_type": "personal"
  },
  {
    "id": 61,
    "title": "Fading Lighthouse",
    "personal_requirements": ["The Fall of Man"],
    "scenario_type": "personal",
    "new_locations": [62]
  },
  {
    "id": 62,
    "title": "Pit of Souls",
    "personal_requirements": ["The Fall of Man"],
    "scenario_type": "personal"
  },
  {
    "id": 63,
    "title": "Magma Pit",
    "scenario_type": "random"
  },
  {
    "id": 64,
    "title": "Underwater Lagoon",
    "scenario_type": "random"
  },
  {
    "id": 65,
    "title": "Sulfur Mine",
    "global_achievements": ["Ancient Technology"],
    "scenario_type": "random"
  },
  {
    "id": 66,
    "title": "Clockwork Cove",
    "global_achievements": ["Ancient Technology"],
    "scenario_type": "random"
  },
  {
    "id": 67,
    "title": "Arcane Library",
    "global_achievements": ["Ancient Technology"],
    "scenario_type": "random"
  },
  {
    "id": 68,
    "title": "Toxic Moor",
    "scenario_type": "random"
  },
  {
    "id": 69,
    "title": "Well of the Unfortunate",
    "scenario_type": "random"
  },
  {
    "id": 70,
    "title": "Chained Isle",
    "scenario_type": "random"
  },
  {
    "id": 71,
    "title": "Windswept Highlands",
    "scenario_type": "random"
  },
  {
    "id": 72,
    "title": "Oozing Grove",
    "scenario_type": "sealed"
  },
  {
    "id": 73,
    "title": "Rockslide Ridge",
    "scenario_type": "sealed"
  },
  {
    "id": 74,
    "title": "Merchant Ship",
    "requirements": ["High Sea Escort"],
    "scenario_type": "city"
  },
  {
    "id": 75,
    "title": "Overgrown Graveyard",
    "requirements": ["Grave Job"],
    "scenario_type": "city"
  },
  {
    "id": 76,
    "title": "Harrower Hive",
    "requirements": ["Bravery"],
    "scenario_type": "sealed"
  },
  {
    "id": 77,
    "title": "Vault of Secrets",
    "scenario_type": "sealed"
  },
  {
    "id": 78,
    "title": "Sacrifice Pit",
    "scenario_type": "city"
  },
  {
    "id": 79,
    "title": "Lost Temple",
    "requirements": ["Fish's Aid"],
    "scenario_type": "city"
  },
  {
    "id": 80,
    "title": "Vigil Keep",
    "scenario_type": "road"
  },
  {
    "id": 81,
    "title": "Temple of the Eclipse",
    "scenario_type": "city"
  },
  {
    "id": 82,
    "title": "Burning Mountain",
    "scenario_type": "road"
  },
  {
    "id": 83,
    "title": "Shadows Within",
    "requirements": ["Bad Business"],
    "scenario_type": "city"
  },
  {
    "id": 84,
    "title": "Crystalline Cave",
    "requirements": ["Tremors"],
    "scenario_type": "city"
  },
  {
    "id": 85,
    "title": "Sun Temple",
    "scenario_type": "road"
  },
  {
    "id": 86,
    "title": "Harried Village",
    "party_achievements": ["The Poison's Source"],
    "scenario_type": "city",
    "new_locations": [87]
  },
  {
    "id": 87,
    "title": "Corrupted Cove",
    "requirements": ["The Poison's Source"],
    "scenario_type": "city"
  },
  {
    "id": 88,
    "title": "Plane of Water",
    "requirements": ["Water-Breathing", "Water Staff"],
    "scenario_type": "city"
  },
  {
    "id": 89,
    "title": "Syndicate Hideout",
    "requirements": ["Sin-Ra"],
    "scenario_type": "city"
  },
  {
    "id": 90,
    "title": "Demonic Rift",
    "scenario_type": "road"
  },
  {
    "id": 91,
    "title": "Wild Melee",
    "scenario_type": "city"
  },
  {
    "id": 92,
    "title": "Back Alley Brawl",
    "requirements": ["Debt Collection"],
    "scenario_type": "city"
  },
  {
    "id": 93,
    "title": "Sunken Vessel",
    "requirements": ["A Map to Treasure"],
    "scenario_type": "city"
  },
  {
    "id": 94,
    "title": "Vermling Nest",
    "party_achievements": ["Through the Nest"],
    "scenario_type": "city",
    "new_locations": [95]
  },
  {
    "id": 95,
    "title": "Payment Due",
    "requirements": ["Through the Nest"],
    "scenario_type": "city"
  }
]