[{
    "id": 1,
    "title": "Black Barrow",
    "party_achievements": ["First Steps"],
    "new_locations": [2],
    "introduction": "The hill is easy enough to find-a short journey past the New Market Gate and you see it jutting out on the edge of the Corpsewood, looking like a rat under a rug. Moving closer you the mound is formed from a black earth. Its small, overgrown entrance presents a worn set of stone stairs leading down into the darkness.\nAs you descend, you gratefully notice light emanating from below. Unfortunately, the light is accompanied by the unmistakable stench of death.You contemplate what kind of thieves would make their camp in such a horrid place as you reach the bottom of the steps. Here you find your answer - a rough group of cutthroats who don't seem to have taken very kindly to your sudden appearance. One in the back matches the description of your quarry.\n\"Take care of these unfortunates,\" he says, backing out of the room.You can vaguely make out his silhouette as he retreats down a hallway and through a door to his left.\n\"Well, it's not every day we get people stupid enough to hand-deliver their valuables to us,\" grins one of the larger bandits, unsheathing a rusty blade.\"We'll be killing you now.\"\nJoke's on them. If you had any valuables, you probably wouldn't be down here in the first place.",
    "treasures": [7],
    "board_square": "G-10",
    "goal": "Kill all enemies",
    "conclusion": "With the last bandit dead, you take a moment to catch your breath and steel yourself against the visions of living remains ripping at your flesh. Your target is not among the dead, and you shudder to think what horrors still await you in the catacombs below. (2)",
    "tiles": ["L1a", "G1b", "I1b"],
    "event_1": {
      "text": "Kicking through the door, you find yourself face-to-face with the reason these bandits chose this particular hole to nest in: animate bones - unholy abominations of necromantic power.\nNothing more to do but lay them to rest along with the remainder of this troublesome rabble."
    }
  },
  {
    "id": 2,
    "title": "Barrow Lair",
    "requirements": ["First Steps"],
    "new_locations": [3, 4],
    "introduction": "The stench of death and rotting flesh gets thicker as you kick past the corpses of your foes and head deeper into the underground burial site. Guided by the muffled sounds of conversation, you find your way through the maze of crypts and burst into a small room full of hard-faced bandits, all with bows at the ready.\nThey're clearly guarding something. You must be in the right place.",
    "treasures": [67],
    "goal": "Kill the Bandit Commander and all revealed enemies",
    "conclusion": "Sifting through the carnage left by the battle, you find a cache at the back of the room containing the scrolls you were hired to collect. You can't help but rifle through them a bit, but find that the writing upon them is in some unknown archaic language. One thing that does jump out at you, however, is a map of the northern countryside. A bend in the Still River is clearly marked as a point of interest. Contemplating whether you want to find out more about this so-called \"Gloom,\" you decide that the spot could be a point of interest for you, as well. (4)\nBut that can be forgotten for the moment. You pack up the papers and head back to Gloomhaven to collect your reward.\nMeeting Jekserah once again at the Sleeping Lion, you hand over the papers and are paid the agreed-upon amount.\n\"You know,\" she whispers to you softly under the bustle of the tavern. \"If you're interested, I may have another job for you. A tribe of Inox in the Dagger Forest has ransacked a couple of my caravans headed to the Capital.\"\n\"I told the militia, but they do nothing,\" she spits. \"I can point you in the direction of their encampment. If you can make an example of them, I will pay you even more.\"\nShe places a crude map of the forest on the table and stands up, her jewelry clinking with the movement. \"Come find me when it is done.\" (3)",
    "board_square": "G-11",
    "event_1": {
      "text": "You open the door to a large crypt littered with coffins. At the back stands your quarry. He fits the description, but there is something previously unnoticed in his eyes - a dark otherworldly force.\n\"Who are you to think you can interrupt the work of the Gloom?\" A dark energy engulfs his hands as he speaks. \"I will show you what you are dealing with!\"",
      "boss_special_1": "The Bandit Commander immediately jumps into a door hex, regardless of how far away it is, and opens it, revealing the adjacent room. Starting with (a), the Bandit Commander jumps to a door in the order of (a), (b), (c), (d), and then back to (a).",
      "boss_special_2": "The Bandit Commander summons one normal Living Bones for two characters or one elite Living Bones for three of four characters.",
      "special_rules": "Doors (a), (b), (c), and (d) are locked and can only be opened by the Bandit Commander."
    },
    "rewards": ["10 gold each", "+1 prosperity"],
    "special_rules": "Add three CURSE cards to each character's attack modifier deck as a scenario effect",
    "tiles": ["B3b", "M1a", "A1a", "A2a", "A3b", "A4b"]
  },
  {
    "id": 3,
    "title": "Inox Encampment",
    "anti_requirements": ["The Merchant Flees"],
    "party_achievements": ["Jekserah's Plans"],
    "new_locations": [8, 9],
    "treasures": [65],
    "board_square": "G-3",
    "goal": "Kill a number of enemies equal to five times the number of characters",
    "introduction": "So this merchant wants to make an example of some caravan raiders? Seems reasonable enough. For the right amount of money, almost anything can be made reasonable.\nYou enter the Dagger Forest and begin to track down the encampment using Jekserah's crude map. It is well-hidden, but following the signs outlined on the parchment, you find a dense cluster of huts in a small clearing of the forest. All that's left is to head in and make that requested example.",
    "conclusion": "Running through the forest, fleeing the smell of burning flesh, you now find more than enough opportunity to contemplate your actions.\nHow your actions sit with you must be visible on your face as you meet once more with Jekserah, this time in her manor. She hands you a sack of coins with a frown.\n\"They were thieves and murderers, \"she says blankly.\"They deserved what you gave them. And that is all I will say of the matter.I have one more task I would like you to perform.I require a diamond of considerable size for a customer, but I cannot find one anywhere in the city.\"\n\"There is a diamond mine, however, in the southern mountains long since lost to the wilderness. I've heard reports that it is now overrun with Vermlings, no doubt with some other more intelligent force behind them.If you can fight your way in and grab the biggest diamond you can find, I will give you a considerable reward.(9)\"\n\"Now leave me in peace.\"Jekserah's two massive Inox bodyguards step forward, directing you to leave the manor.\nOutside, contemplating your new task, you hear a small voice behind you.\"She's not looking for profit, you know.\"\nYou turn around to see a female Quatryl step out of the alley beside Jekserah's house.She's clad in dark leather armor and holds a conspicuous contraption full of whirring gears and topped with a conical metal piece connected to a tube.\n\"Argeise, city guard, \"she says, introducing herself. \"I know, I don't exactly look the part, but if anyone isn't what they appear to be, it's that Valrath you've been talking to. Sure, she's a merchant, but she's up to something far more sinister.\"\n\"She's been trying to overthrow the military in Gloomhaven for as long as I've been here, and we're all very curious about what her current machinations are.\"\n\"Look, you can go do her bidding like a good little puppy if you want, but if you'd rather actually help this town keep the peace and not get overrun by the wilds, I have a different idea. We'll get to the bottom of Jekserah's plans and expose her for who she really is.\"(8)",
    "special_rules": "Until door (1) is opened, one normal Inox Guard spawns at (a) at the end of every odd round for two characters of the beginning of every round for three or four characters.",
    "event_1": {
      "text": "You push your way into the back cave only to be faced with a half-dozen crying, screaming Inox children. You have little opportunity to contemplate the implications of this development, however, as you find yourself also staring down the bows of several Inox archers. Your only option is to continue fighting."
    },
    "rewards": ["15 gold each", "+1 prosperity"],
    "tiles": ["L1b", "L3a", "B1a", "B2a", "B3a", "B4a", "E1b"]
  },
  {
    "id": 4,
    "title": "Crypt of the Damned",
    "new_locations": [5, 6],
    "introduction": "The bandit commander's proclamations of a \"Gloom\" do not sit well in your stomach as you search the bend in the Still River - something here holds an interest for these maniacs.\nYou are somewhat surprised to find the ruins of an ancient crypt half - covered in moss and ivy.The history of this place is old and dark.With no other information to go on, you head down into the depths.Whatever these supposed bandits are up to, you're determined to find out, even after you stumble across a large group of them and more animated dead at the bottom of the stairs.\n\"You've made a mistake coming here\" one of the bandits hisses. You disagree. You are right where you want to be.",
    "treasures": [38, 46],
    "goal": "Kill all enemies",
    "conclusion": "It is clear that you have disrupted some sort of ritual here. These elemental demons belong on an entirely different plane of existence, but the cultists have somehow managed to pull them through to this one.\nOn the altar in the back room, there is a wealth of scribblings on these rituals. Not all the writing is intelligible, but you get the sense that this crypt is a place of power once used by an ancient civilization. The ancients tapped the power of the elements to enhance their own lives, and while their exact fate is beyond your knowledge, it clearly didn't end well.\nAmong the scripts you also find notes on a couple of other places of power in the area.One appears to see heavy use with the cult and the other is marked as being overrun by vicious undead.It looks as though you have opportunities to either disrupt more of their work(5) or get in their good graces by helping to clear out a threat.(6)",
    "board_square": "E-11",
    "event_1": {
      "text": "You bash in the door, thinking you are prepared for anything. Before you, however, stands a creature of pure elemental energy, enraged and demonic. It takes you a second to collect yourself. As if animating the dead wasn't enough for these lunatics."
    },
    "tiles": ["E1a", "G1b", "C1a", "M1a"]
  },
  {
    "id": 5,
    "title": "Ruinous Crypt",
    "new_locations": [10, 14, 19],
    "goal": "Kill all enemies",
    "introduction": "Your mission is clear. These elemental cultists are distorting the fabric of the world and must be stopped. With that goal in mind, you follow the writings to an ancient crypt you believe to be the cult's base of operations. Steeling yourselves for combat, you batter through the rotted door and charge into the hall of the crypt.\nThe sight before you is both wondrous and horrifying.A group of cultists is performing ritual incantations in front of a black, gaping hole in reality.They turn toward you and snarl, unsheathing their sacrificial daggers. Behind them an inky darkness spills forth from the hole and coalesces into nightmarish forms full of teeth and claws.You know you must send these terrors of the elemental plane back into the void, but you are paralyzed with fear.",
    "conclusion": "With the cultists and their minions dead, it seems the dark rift is now dormant. It is no less disconcerting, however. You toss a rock at it, and the rock disappears into nothingness. You must admit that you wonder whether you could enter the rift yourself and whether you could survive the trip to wherever that rock ended up. (10)\nAlternately, finding some way to close the rift is probably the more prudent decision.There is an Aesther enchanter in Gloomhaven who may know more about this inter - planar stuff.She's been known to ask for impossible favors before she helps anyone, though.(14)(19)",
    "treasures": [4, 28],
    "board_square": "D-6",
    "special_rules": "All characters start with DISARM as a scenario effect.",
    "tiles": ["M1a", "K1a", "K2b"]
  },
  {
    "id": 6,
    "title": "Decaying Crypt",
    "party_achievements": ["Jekserah's Plans", "Dark Bounty"],
    "new_locations": [8],
    "treasures": [50],
    "goal": "Reveal the M tile and kill all revealed enemies",
    "introduction": "What is life without a little bit of intrigue? The cultists have clearly marked this crypt as a spot of trouble for them. Perhaps clearing the place out will put you in their good graces. Or maybe you're just hoping to find a big stash of treasure, untouched by looters' hands.\nOnce you arrive, the smell makes you regret your decision more than anything else. It's not the fact that you've had it about up to here with exploring old decrepit ruins. It's not the undead horrors shambling and moaning in the shadows. It's the smell.The smell of death and soullessness and rotting flesh.",
    "conclusion": "After the terrible shrieks and moans of the undead, the sound of someone clapping is at once foreign and alarming. Turning around, you see a hooded figure standing at the edge of your torchlight. You raise your weapon, but the grin on his silhouetted face isn't menacing in a way that calls for arms. It is menacing in a way you've never experienced before.\n\"Well done, sirs, \"the figure lilts. \"My, my, but you do have a way about you, don't you? And you've certainly gotten our attention now, removing this troublesome crypt of its rogue undead element.We very much prefer our undead to be the controllable variety, now don't we?\"\nThere is a long pause as the figure stares at you, still grinning.\n\"Well, perhaps you'd be so kind as to do us another favor? After which we'll be mostly settled on the whole issue of you murdering some of my brethren.\" He stops grinning.\n\"There's a necromancer in Gloomhaven. Been giving us a spot of trouble, sending mercenaries out to do her dirty work against us. Maybe you've met her.\"\n\"Kill Jekserah. Bring her head to our headquarters, and we'll see about letting you live.\"(8)",
    "board_square": "F-10",
    "special_rules": "Add three CURSE cards to each character's attack modifier deck as a scenario effect",
    "tiles": ["L1a", "K1a", "K2b", "M1a"],
    "rewards": ["5 gold each"]
  },
  {
    "id": 7,
    "title": "Vibrant Grotto",
    "requirements": ["The Power of Enhancement", "The Merchant Flees"],
    "new_locations": [20],
    "board_square": "C-12",
    "goal": "Loot all treasure tiles",
    "introduction": "You gingerly step into the entryway of the Crooked Bone, careful to avoid the broken glass, nails, and other treacherous things. You glance around the room and see nothing but the usual detritus. Before you can call out to Hail, though, an explosion from an upper room violently shakes the entire building.\n\"Damn it all to the abyss!\" Hail's disembodied voice yells out.\"I set up my work in the most out-of-the-way, uninviting, decrepit little hovel, and grand idiots still manage to stumble in and disrupt my research.\"\n The translucent woman suddenly appears before.\"You do know that your mere presence in this building changes the flow of the ether, causing unanticipated currents that produce catastrophic consequences, right? I mean, how could you not know that ?\"\nHail closes her eyes and begins to take deep breaths, fading a little out of view with each exhale.\"Yes, I did agree to help you.I had hoped the memory was a nightmare of some kind, but it wasn't, so that can't be helped now.The least you can do inreturn, however, is to warn me before you cross the threshold.\"\nShe gives you an icy stare.\"So what do you want, anyway? Let' s make this quick.\" You explain to her the situation with Jekserah and the need to locate where she is hiding.\n\"Ah, a simple scrying matter? Well then, we are in luck, \" Hail begins. \"Or rather, I' m in luck.The main component I would need for such a task is biteroot, and I ran out of it just last week.I was going to gather more, but now I can just send you out to get it instead. Everyone wins!Except those infernal forest imps who terrorize my usual gathering spot. I hope quite a few of them will end up dead.\"\nA small map drops in your hand, and, with a wave of Hail's arms, a sudden, powerful force pushes you out the door.\"Remember: ring the bell when you come back and wait fortyseven seconds before entering the door!\"\nYou are able to follow the map to a network of small caves just north of the Dagger Forest.The place is teeming with life: lush, massive plants, as well as a number of hostile animals and imps.You prepare for their attack.",
    "special_rules": "The treasure tiles can only be looted using a Loot action. They cannot be looted by normal end-of-turn looting.",
    "tiles": ["M1b", "D2b", "C2a", "G2a", "F1b", "B4b"],
    "conclusion": "You pull up the last bush and hack away at its root. The grotto is still alive with many hostile creatures, but with your packs now full of biteroot, you make a quick retreat, eventually finding your way to the Stone Road and back to Gloomhaven and the Crooked Bone.\nYou ring the bell and wait a good minute before entering the slanted doorway. There's no sign of Hail, so you call out and wait for her. It takes much longer than you'd like.\nWhen she finally does appear on the other side of the ruined bar counter, she seems genuinely surprised to see you. \"Is that biteroot you have there? Ha, imagine that, I was just thinking about going to get some, seeing as I just ran out last week.\"\nYou stare at one another in confusion.\n\"Oh, I sent you to get that, didn't I?\" Hail scratches her head. \"Right, scrying. I remember now. Hand over the root.\"\nYou give her the packs full of biteroot. \"What were the details again? Jekserah? Valrath woman, yay high? Merchant dabbling in necromancy? Wears a red cape and lots of gold jewelry? Shouldn't be too hard.\"\nHail disappears with the root and you begin to hear a faint banging coming from the floor above you.\nEventually Hail appears before you holding a parchment covered in a thick, gooey biteroot paste. \"There you go. Just follow that, and you should find your way to where she's hiding.\"You hesitantly take the map. \"I could have cleaned off the paste, but I thought it added a bit of charm.\" (20)"
  },
  {
    "id": 8,
    "title": "Gloomhaven Warehouse",
    "requirements": ["Jekserah's Plans"],
    "anti_requirements": ["The Dead Invade"],
    "global_achievements": ["The Merchant Flees"],
    "new_locations": [7, 13, 14],
    "treasures": [51],
    "board_square": "C-18",
    "introduction": "At the behest of your mysterious contact, you sneak towards Jekserah's warehouse under the cover of night. With any luck, you'll be able to uncover her plans an put a stop to them.\nHoping to find the warehouse largely abandoned, you instead discover that it is teeming with undead. At least that gives you a better idea of her plans. She's clearly been using the necromantic scroll you delivered to raise the undead within the city walls, and now it is time to put them back to rest.",
    "goal": "Kill both Inox Bodyguards",
    "event_1": {
      "text": "Barreling through the gauntlet of storage shelves, traps, and undead, you finally make it to the back room of the warehouse, face-to-face with Jekserah and her two Inox bodyguards.\n\"So, you've decided to disrupt my plans instead of help me? You will regret that decision when I return to Gloomhaven with a legion of undead at my back!\"\nMoving with great speed, Jekserah turns and runs from you, flipping out a window. You make a move to pursue her, but the two gargantuan Inox block your advance."
    },
    "conclusion": "With the battle behind you, you look out the window and see no evidence of the fleeing Valrath. You've stopped her plans for now, but after your brief conversation, it is clear you need to hunt her down before she can make good on her threats. (13)\n\"She's beyond my network, \"the city guard Argeise says with a shrug when you ask her later. \"We'd like to make sure she won't cause more trouble, but she's fled the city, and I'm not about to go traipsing through the wilds.\"\n\"You might have more luck with the Aesther enchanter in town, \"she suggests. \"She can surely divine the coward's location for you, if you can get her to cooperate.\"(14)(7)",
    "rewards": ["+2 reputation"],
    "tiles": ["I1a", "I2b", "G2b"]
  },
  {
    "id": 9,
    "title": "Diamond Mine",
    "anti_requirements": ["The Merchant Flees"],
    "global_achievements": ["The Dead Invade"],
    "new_locations": [11, 12],
    "board_square": "L-2",
    "goal": "Kill the Merciless Overseer and loot the treasure tile",
    "introduction": "Ignoring Argeise's warnings, you head to the diamond mine. \"Sinister machinations\" is, of course, a troubling phrase to throw around, but the phrase \"considerable reward\" trumps that in a heartbeat.\nHeading into the damp underground cavern, you were expecting to find a few scraggly Vermlings to make easy work of. You certainly weren't expecting a pack of vicious hounds guarding the entrance. Finding this diamond may prove more difficultly that originally anticipated.",
    "rewards": ["20 gold each", "+1 prosperity"],
    "event_1": {
      "text": "You move through a tight crawlspace clearly more suited to the ratlike Vermlings into a large chamber full of rubble and Vermling miners on high alert. Toward the back of the chamber, a man in a dark robe cracks a whip and begins spitting orders at the miners, who turn their pickaxes away form the stone walls and toward you.",
      "boss_special_1": "All Vermling Scouts immediately take an extra turn using the action card drawn for them this round.",
      "boss_special_2": "The Merciless Overseer summons two normal Vermling Scouts for two characters, one normal and one elite Vermling Scout for three characters, or two elite Vermling Scouts for four characters."
    },
    "conclusion": "With the overseer dead and the diamond in hand, you head back to Jekserah to claim your reward. Her bodyguards escort you inside the manor where you find her somehow different - more harrowed and grim.\n\"Wonderful.\" She exchanges the diamond for a large purse full of coins. \"This will serve beautifully as a focus for the incantations. I wonder if the cultists even knew what they had here. With this, I can summon an entire army of undead!\"\nShe turns to you with a strange glint in her eye. \"So then! Are you ready to overthrow the military of Gloomhaven and put control of the city into the hands of the Merchant's Guild? (11) Or do you not have the stomach to effect real change? (12)",
    "tiles": ["I2a", "N1a"]
  },
  {
    "id": 10,
    "title": "Plane of Elemental Power",
    "anti_requirements": ["The Rift Neutralized"],
    "party_achievements": ["A Demon's Errand"],
    "new_locations": [21, 22],
    "tiles": ["D1b", "G1a", "L1b", "L3a"],
    "goal": "Kill all enemies",
    "board_square": "C-7",
    "introduction": "Your vision shifts and blurs around you. Nightmarish wailing pierces your ears. You feel your extremities stretching out, as if the universe is trying to tear you apart.\nAnd then it stops. You open your eyes to see your feet are on solid ground, but around you whirls strange elemental energies - fie mixing with ice in torrential power. You catch your breath and glance back, relieved to see a void of darkness similar to the one that brought you to this place.\nThe relief is short-lived, however, as a booming voice fills the crackling air. \"Who are you to slay my servants and invade my realm? This affront will not go unpunished!\"\nBefore you the energies in the air begin to form vague demonic shapes. To go deeper into this unearthly place, you must fight your way through.",
    "conclusion": "As the final demon in sight screams and dissipates into the wind, you fall to your knees, thankful that the assault has stopped.\n\"Very interesting.\" The voice appears deep inside your head, clawing at your brain with its words. \"You interlopers are unexpectedly powerful. I could certainly use your expertise to find something in your own plane.\"\nThe red rock below you rumbles and cracks, and a fiery fissure opens at your feet. \"I open my realm to you. Come, let me speak to you face-to-face.\"\nHaving already made one leap of faith this day, you decide there's no harm in making another. The heat grows more intense as you descend, and scalding air billows up from below, slowing your fall. You land quite safely in what appears to be an underground temple. Before you stands a monstrous creature, horned and terrifying, holding a trident and standing on four hooved legs.\nThe voice still resonates from inside your head. \"Brave and foolish. You should serve me well. There is an artifact of great power located in a forgotten temple along the Serpent's Kiss River. You can retrieve it for me, (22) or you can die here and now.\" (21)"
  },
  {
    "id": 11,
    "title": "Gloomhaven Square A",
    "anti_requirements": ["End of the Invasion"],
    "global_achievements": ["City Rule: Economic", "End of the Invasion"],
    "board_square": "B-16",
    "new_locations": [16, 18],
    "tiles": ["D1a", "H1b", "L1a", "L2b", "E1a"],
    "goal": "Kill the Captain of the Guard",
    "introduction": "Jekserah's plan is troubling, but it is certainly sound in some dark, twisted sense. You've seen the guards on the wall. They can barely fight back the Vermlings, and their taxation is strangling the town and your own pocket.\nWith an army of undead, the merchants can govern the city into an age of prosperity and keep it safe from the forces outside the walls.\n\"So are you ready to take the fate of this city into your own hands, mercenaries?\"\nYou nod in assent. \"My army is ready. We march for the Ghost Fortress!\" A commotion in the foyer startles you away from Jekserah's rally. Rushing into the room, you see a troop of solider standing over the bodies of Jekserah's Inox guards.\n\"This ends now!\" Argeise points a crossbow at you. \"I tried to warn you. Do you have any idea what you are unleashing on the city?\"\n\"It's too late,\" Jekserah spits from behind you, \"They can't stop us! My army has already dispersed into the city. It will only grow with every guard who falls.\"\nJekserah turns to you. \"Head to the Ghost Fortress. If the Captain of the Guard falls, any resistance to our new order will fall soon after.\"",
    "special_rules": "All Living Bones and Living Corpses are allies to you and enemies to all other monster types.",
    "rewards": [
      "15 gold each",
      "-2 reputation",
      "+2 prosperity",
      "\"Skullbane Axe\" design (Item 113)"
    ],
    "event_1": {
      "text": "With the guards' bodies in your wake stirring and rising as the undead, you knock through the fortress door. \"Today we stand against the darkness!\" The Captain of the Guard bellow at you, surrounded by soldiers. \"To me! I will not let the city fall to this scum!\""
    },
    "conclusion": "The last of the guard falls, and once more you see a transformation of the bodies into soulless walking corpses. Jekserah steps through the doorway behind you.\n\"You have done well, mercenaries-proved yourself in the face of these relentless pigs. With my bodyguards dead, you will be my new right hand, and we will rule over this city as it was meant to be ruled over. The last remnants of the old empire has finally fallen, and you should be proud.\"\n\"But there is still much work to be done. The merchant guild grows concerned about the declining quality of our water supply. We feel there may be some dark force at work below the sewers, poisoning the city. (18) I've also heard some talk behind closed doors of a dragon making roost in the Copperneck Mountains. Some merchants can be such children, but still, the reports are worth investigating. Whatever it is could be a threat to the city.\" (16)"
  },
  {
    "id": 12,
    "title": "Gloomhaven Square B",
    "board_square": "B-16",
    "anti_requirements": ["End of the Invasion"],
    "global_achievements": ["End of the Invasion"],
    "new_locations": [16, 18, 28],
    "goal": "Kill Jekserah",
    "introduction": "As Jekserah outlines her plan, you find yourself slowly backing out of the room. Protecting this city with an army of undead is madness. You cannot give over all the power to an unscrupulous necromancer.\nIn mid sentence, Jekserah looks up at you and stops. \"What is the matter?\" She frowns. \"Are you losing your nerve here at the end? You've already killed so many in my service. What is just a few more?\"\nYou quickly turn and run for the door. Her army is too massive to take on without help.\n\"Foolish mercenaries,\" she laughs behind you. \"I thought you'd want to join me in this new venture, but if you'd rather die like the rest of the military scum, that can be arranged!\"\nYou race through Gloomhaven Square to the Ghost Fortress. Guards stop you at the gate and you hurriedly explain the threat looming behind you. Frantically you push past them, looking for the Captain of the Guard.\n\"This is truly troubling,\" the Captain says after you quickly outline Jekserah's plan. \"We must move against this necromancer immediately!\" The sound of steel on steel reverberates through the room, followed by the yells and screams of the guard outside.\n\"They are upon us!\" The doors bust open and the decaying shapes of the living dead stream into the room. \"To arms! Fight them back!\"",
    "event_1": {
      "text": "The waves of undead crashing against your weapons have finally subsided as you reach Jekserah's manor and kick in the door. You see her in the foyer, shaking with rage.\n\"You will not defeat me! My army has been cut back, but the dead are fuel to my fire. My army is infinite and eternal!\"",
      "boss_special_1": "Jekserah summons two normal Living Bones for two characters, one normal and one elite Living Bones for three characters, or two elite Living Bones for four characters.",
      "boss_special_2": "This is the same as Boss Special 1, except that Living Corpses are summoned instead of Living Bones."
    },
    "special_rules": "All City Guards and City Archers are allies to you and enemies to all other monster types.",
    "conclusion": "Jekserah collapses, the life fleeing her eyes. \"I...\" she whispers at you. \"You have no idea what's coming...\" (28)\n\"Infuriating. \"The Captain of the Guard steps up behind you, wiping his blade on his tunic. \"So much needless death, eating ourselves from the inside. At least it is over now.\"\nHe looks from Jekserah's lifeless corpse to you. \"Listen, you have proven yourself this day. Without your warning and without your strength, we would have been overtaken by the undead. If you're interested, I may have some more work for you.\n\"First of all, we've had reports from the north about large flying creatures. People are afraid of dragons.\" He shakes his head in annoyance. \"I'd like you to head to the northern pass and investigate. (16)\n\"Closer to home, however, there is some trouble brewing in the sewers below the Sinking Market. The wells in the area seem to be poisoned, and the sewers have become infested with snakes and sentient slimes, making further investigation difficult. I need you to discover the source of the poison.\" (18)",
    "rewards": ["+4 reputation", "\"Skullbane Axe\" design (Item 113)"],
    "tiles": ["E1a", "L2b", "L1a", "H1b", "D1a"]
  },
  {
    "id": 13,
    "title": "Temple of the Seer",
    "global_achievements": ["End of the Invasion"],
    "new_locations": [15, 17, 20],
    "board_square": "N-3",
    "introduction": "You reach out to some of your contacts concerning Jekserah's location, and end up with an odd bit of information from the Sanctuary of the Great Oak. They say there is a temple high in the Watcher Mountains dedicated to some unseen force that can answer any questions asked of it. Visitors must survive the journey and the trials that await inside the temple first, however.\nIt is a tradition among the order of the Great Oak to send its members on a pilgrimage to this temple, where, faced with the prospect of any knowledge they desire, they decline to ask a question, putting all their trust in the Great Oak instead. The Sanctuary provides you with some basic directions, and you head off.\nWhile your path is clear, the way is anything byt easy. You risk falling to your death numerous times as you scale the cliff up to the temple. Braving the harsh winds and loose rocks, you finally reach the top and head through the threshold into a large, open foyer.\n\"I am afraid I cannot accept visitors at this time,\" a disembodied voice booms through the room. \"Please come back in twelve years. I may be able to accommodate you then.\"\nBefore you can object, a group of massive stone constructs materialize before you.\n\"I know, I know,\" the voice says. \"You have questions, I have answers. Unfortunately, if you don't leave now, you won't have a head to ask the questions in the first place.\"\nYou ready your weapons. There's no way you're going to climb back down that cliff with nothing to show for it.",
    "event_1": {
      "text": "You open the door to the inner chamber, and more enemies materialize before your eyes. Flying red lizards, wailing spirits, and great, terrifying bears that don't seem at all happy to have been suddenly transported here."
    },
    "conclusion": "As the last of the creatures falls, the temple becomes eerily silent. You call out, but the strange voice offers no response. You begin banging the walls with your weapons and yelling even louder, making it clear that you will not leave until you have answers.\n\"ENOUGH!\" The power of the voice shakes the ground. \"I could easily kill you, you know. But normally a threat is enough to send you pathetic lesser begins scrambling. I don't necessarily like murder, however, so I will make you a deal. I will answer a single question for you, and then you will leave this place without further incident and never return.\"\n\"So what would you like? Great power? (15) Great wealth? (17) Or is the location of the necromancer you are hunting really that important to you? (20)\"",
    "tiles": ["M1a", "N1b"]
  },
  {
    "id": 14,
    "title": "Frozen Hollow",
    "global_achievements": ["The Power of Enhancement"],
    "board_square": "C-10",
    "goal": "Kill all enemies",
    "special_rules": "Add three -1 cards to each character's attack modifier deck as a scenario effect",
    "tiles": ["K1b", "K2a", "I2a"],
    "introduction": "An enchanter has been called for, so an enchanter must be found.\nFollowing reports of an Aesther in the Boiler District, you find yourself standing before an abandoned and decrepit tavern: the Crooked Bone. Opening the door, the inside looks exactly as the outside advertised: spiderwebs, splintered stools, and dusty, broken glass.\nStepping pas the threshold, a translucent female suddenly appears before you. \"Why have you come to this place, mercenaries? Your presence is unwanted, and you are disrupting my research.\"\nYou quickly explain why you have come and the woman's frown deepens.\n\"'Oh, look at the Aesther woman. She can fulfill all our wishes. All she has to do is wave her hands and our wildest dreams will come true.'\" She sights in frustration and actually does wave her hands. \"Leave me in peace.\"\nYou don't move. She stares.\n\"Well, instead of disrupting, then maybe you could help. Scratch my back, maybe I'll scratch yours. That's how these things work, right?\" The Woman turns and walks towards a destroyed set of stairs, but after a few steps, she fades away entirely.\n\"I need an orb from the Frozen Hollow in the Copperneck Mountains.\" The woman's voice comes from directly in front of you, as if she hadn't moved at all. \"Bring it back to me and I may help you.\"\nA map drops at your feet. \"My name is Hail by the way. Do not come back without the orb.\"\nThe map is easy to follow. Deep in the Copperneck Mountains, obscured by snow drifts, you find the opening to a dark, narrow cave. The wolf tracks around the entrance are troubling, but, with a firm resolve, you enter.",
    "conclusion": "With the last of your adversaries dead, you approach the back of the chamber, where a small blue sphere floats above the floor. You slowly reach out your hand and find the orb cold to the touch. With a firm grip on it, the temperature is almost unbearable, but you quickly stash it into your pack and make your way back to the Crooked Bone.\nYou enter the abandoned tavern and call out to Hail. With no response, you wander around, observing the chaotic mess around you. You wonder how she gets any work done in this environment. As you approach the counter, Hail appears before you, holding the orb.\n\"Very interesting.\" She doesn't seem to notice you at all. \"A rift in our plane, somehow contained within a spherical barrier. Good thing you didn't break this on your way back. You easily could have been sucked into a realm of pure frost and been frozen solid before you had time to breathe. Or something worse could have happened.\n\"It's just so confounding. Who would have the power to do this?\" Hail takes a step to the left and disappears again.\nYou wait for what feels like hours, refusing to sit on the few stools that haven't yet fallen apart. You call out occasionally, but receive no response.\n\"Oh, you're still here.\" You turn around to see Hail in the middle of the room. \"Good, I'd like to experiment on you if it's all right.\" She reaches out to you and you stumble backward, falling over a table that splinters into hundreds of pieces.\n\"Oh, don't be a baby about it. I'm pretty sure it will end well.\"\nHail explains that she wants to try to bring forth raw power from another plane and contain it in a small orb that could give enhanced powers to anyone possessing it. The containment process, however, requires a lot of gold metal.\n\"Now that you have helped me in my endeavors, I suppose I should return the favor,\" Hail sighs. \"So what was it exactly that you wanted?\" (7) (19) (31) (43)"
  },
  {
    "id": 15,
    "title": "Shrine of Strength",
    "board_square": "B-11",
    "goal": "Loot the treasure tile",
    "introduction": "Nestled in a high valley deep in the Copperneck Mountains, this shrine is not easily found or accessible, but luckily, you know the way.\nThe shrine lies on the dge of a giant frozen lake surrounded by ancient, towering trees. Adorning the structure's stone face are innumerable symbols of power and strength, but you cannot determine whether the shrine was dedicated to some specific entity or simply to the general concept of strength.\n You enter through the large stone doors, hoping to find something within that increase your own power. As you walk along the entryway, you see a number of runic inscriptions carved into the walls. They are hard to make out, but you believe they profess an ideology of \"Strength begets strength.\" In order to increase one's own strength, one must first demonstrate strength.\nYou open the next set of doors and come face-to-face with that ideology in practice. A powerful Savvas materializes in front of you and wordlessly begins to channel a destructive force in your direction. You will need to prove yourself to get as whatever is in this temple.",
    "special_rules": "Doors (a) are locked and open when any character occupies pressure plate (c) at the end of their turn.\nDoors (b) are locked and open when all characters occupy a pressure plate on one of the H tiles at the end of a turn. For two characters, the plates (d) must be occupied. For three characters, the plates (d) and (e) must be occupied. For four characters, the plate (d), (e) and (f) must be occupied.",
    "conclusion": "You rush forward and take hold of the sigil of strength lying on a pedestal in the inner chamber. Immediately an overwhelming power surges through you and all of your foes disappear as quickly as they had appeared.\nYou feel a great strength welling up inside you. For an instant, your vision goes dark, and you see images of a strange runic alphabet.\nThe power dissipates and your vision returns. You quickly write down the symbols that you saw, though you do not know their meaning.\n Translate(INSERT TEXT HERE)",
    "rewards": ["20 experience each"],
    "tiles": ["L1a", "D1a", "H1b", "H3b", "C1a"]
  },
  {
    "id": 16,
    "title": "Mountain Pass",
    "new_locations": [24, 25],
    "board_square": "B-6",
    "introduction": "There is a certain shaking of heads that happens along with the mention of dragon.s as if the person saying it can't even believe the words coming out of their mouth. Dragons don't exist, they say, but some giant, winged beast has been sighted to the north, so you set off to see if maybe they do.\nYour goal is the Icecrag, the tallest mountain in the Coppernecks. To get there, though, you'll need to head through the northern pass, a narrow corridor between two massive stone cliffs that is known for frequent avalanches and other dangers.\nYou tread carefully, watching high above you for any signs of an ambush. This wariness is what saves you from being crushed by a hail of boulders rumbling down the cliff side. You dive for cover as the rocks hit, then look up to see a group of Inox emerging from a concealed cave to one side of the pass.\nThey intended to kill you with the rocks, but your survival has only motivated them to pursue a more conventional option.",
    "event_1": {
      "text": "With the pass blocked by the avalanche, you enter the cave to face your aggressors. Inside you see a network of passages leading deep into the mountain. Perhaps they would be worth exploring once your foes ares dead."
    },
    "conclusion": "What were Inox and demons doing together? And so far north? You rifle through their belongings, looking for some indications of their motivations. All you find is some crude scratching referencing a \"voice\"\nYou glance toward the cave. There may be some clues farther down the tunnels.\nTo the north, Icecrag Peak looms large in the distance. (25) Still, you feel something calling you to explore the cave. (24) Not audibly, but there is a subtle and powerful urge.\nYou look down at the Inox's scribblings. A voice - yes, somehow that sounds familiar. You can almost hear it yourself.",
    "goal": "Kill all enemies",
    "tiles": ["B4b", "A2b", "K2a", "I2a"]
  },
  {
    "id": 17,
    "title": "Lost Island",
    "board_square": "K-17",
    "introduction": "There are many undiscovered islands in the Misty Sea. Most are not worth finding, but still, you are confident that you will find vast riches on this particular one.\nThe sea voyage is largely uneventful. You follow the signs until you spy a small mass of land on the horizon.\nIt doesn't get much bigger as you get closer - just a simple piece of earth jutting out og the water, covered in tress and large rocks. On the opposite side of the island, you see the remains of a derelict ship. You drop anchor and paddle to dry land.\nAs your feet hit the sand, an arrow whizzes by your ear and another grazes your leg. Readying your weapons, you see numerous Vermlings scurrying about in the underbrush, preparing to attack your position. And then you hear the roar of a bear.",
    "event_1": {
      "text": "Who knew so many of these damned creatures could exist on such a small island? Entering their dwellings onboard the derelict ship, you see more emerge from the shadows. Along with them, however, you see the glinting of gold. This tribe has indeed amassed a great wealth in this ship."
    },
    "conclusion": "With the distractions of flashing swords and swiping claws put to rest, you investigate further to find great caches of gold below deck. Who knows what the Vermlings were using the gold for, but you have a good idea what you will use it for.",
    "rewards": ["25 gold each"],
    "tiles": ["L1b", "L3a", "B3a", "B4a", "C1b"],
    "goal": "Kill all enemies"
  },
  {
    "id": 18,
    "title": "Abandoned Sewers",
    "new_locations": [14, 23, 26, 43],
    "goal": "Kill all enemies",
    "board_square": "C-14",
    "introduction": "From the center of the Silent Bridge, a city guard points you to a grating underneath the west side. \"That's the best way in that hellhole. Good luck.\"\nIt takes a bit of climbing, but you eventually make your way down to the grate, which has been twisted and broken over the many years. You light a torch and step inside, following a narrow path up a slight incline, avoiding the stream of brown liquid running in the opposite direction. After a few minutes, the path opens up into a series of branching passageways.\nYou start to look around, deciding on which way to go, when hissing sounds echo through the stonework toward you. You hold fast to your weapons, straining to see multiple slithering shapes approach.",
    "event_1": {
      "text": "Navigating through the passageways, you find yourself in a large, open room with a cistern in the center. Around the cistern stand a group of Vermlings, who look up and snarl in your direction. This must be the cause of the poisoned water."
    },
    "conclusion": "The Vermlings lie dead, their dark blood mixing with the pools of water on the floor. Investigating further, you find no poisons of any kind on the corpses. Is it possible these vermin were not the cause and instead were just living here, away from the eyes of the guard? At the back of the room, large cracks are present in the wall, displaying a passage deeper into the depths. (23)\nAnd if you had some way to breathe underwater, (14)(43) you may even be able to enter the cistern and find the source that way. (26)",
    "tiles": ["H1b", "H3b", "M1a"]
  },
  {
    "id": 19,
    "title": "Forgotten Crypt",
    "requirements": ["The Power of Enhancement"],
    "party_achievements": ["Stonebreaker's Censor"],
    "new_locations": [27],
    "board_square": "M-7",
    "goal": "Protect Hail (a) until she reaches the altar (b)",
    "introduction": "\"You want to do what now?\" Hail stares at you blankly. \"You've found a rift into the Plane of Elemental Power and you want to close it?\" She sights.\n\"Well, I did agree to help you.\" Hail begins tossing the orb you retrieved up and down in thought. \"Okay, based on your description, it's going to take a little extra work to close a rift of that magnitude. I could do it myself, but it would take a while, and it may get troublesome if we were to be attacked by the other side in the middle of the incantation. It would be much easier to do if I had an elemental censer, which, really, is entirely too convenient, because I've been wanting to get my hands on one for my studies anyway.\n\"I knew a powerful elementalist who owned one many years ago. He's dead now, but I'll take you to his crypt personally. I'd advise against handling the censer on your own.\"\nAfter a day's journey, you find an ancient, overgrown mausoleum resting along the Serpent's Kiss River.\n\"Stonebreaker really was a nice fellow. Getting crushed by massive boulders is just one of the hazards of being an elementalist, though.\" After clearing away the overgrown vines, you head down into the crypt.\n\"Oh great!\" Hail says. \"These blasted cultists are everywhere nowadays. Probably looking for the censer, too. Or they simply don't want you to have it.\"\nYou look at Hail with confusion, and she points to the shadows, where dark figures in black robes emerge.\n\"You shouldn't have come here, ghostface,\" one of them says.\n\"Ugh,\" Hail sighs. \"Dispatch these simpletons quickly. I'm already bored with them.\"",
    "special_rules": "Add three CURSE (CURSE) cards to each character's attack modifier deck as a scenario effect.\nHail (a), represented by a numbered token, has 4+(2*L) hit points. She is an ally to you and an enemy to all monster types. She acts on initiative 99 each round, performing \"Move 2\" towards the altar (b), opening doors and springing traps if necessary. The scenario is complete when she ends her turn in a hex adjacent to the altar. If Hail is killed, the scenario is lost.",
    "event_1": {
      "text": "There is no rest among these cursed undead. As you kick through the door into the next room, you hear more commotion from the entrance. \"There's more of them behind us!\" Hail yells.",
      "special_rules": "Spawn one normal Cultist for two characters or two normal Cultists for three or four characters at (c)"
    },
    "event_2": {
      "special_rules": "Spawn one normal Living Spirit for two characters or two normal Living Spirit for three or four characters at (d)"
    },
    "event_3": {
      "special_rules": "Spawn one normal Living Bones for two characters or two normal Living Bones for three or four characters at (e)"
    },
    "conclusion": "Hail moves forward and grabs hold of the censer. She lifts it aloft and speaks a few words in an unknown language. Fire bursts forth and immolates the remaining undead, reducing them to ash.\nHail breaks the smallest of smiles. \"Well, now that that annoyance has been dealt with, let's get on with the real fun. Show me to this rift of yours.\" (27)",
    "tiles": ["D2a", "D1a", "C2b", "C1a", "I1b"],
    "rewards": ["+1 prosperity"]
  },
  {
    "id": 20,
    "title": "Necromancer's Sanctum",
    "requirements": ["The Merchant Flees"],
    "new_locations": [16, 18, 28],
    "board_square": "H-13",
    "goal": "Kill Jekserah",
    "introduction": "One thing is for certain: you never would have found Jekserah's lair without help. Deep in the Dagger Forest, you would have become hopelessly lost hours ago if not for the detailed directions you carry.\nAfter various twists and turns, you find yourself staring at an ancient mausoleum, hidden in the growth of the forest.A massive tree trunk mostly blocks the entryway.This building must have been built ages ago and was long forgotten by time.\n You squeeze past the tree trunk into the dark halls of the tomb.You light a torch and wait silently, listening for sounds of inhabitants.It is faint, but to your left you hear a shuffling sound. You move closer and open a set of stone doors.Ahead of you, the torchlight catches shadows of the living dead.It looks like Jekserah is hard at work rebuilding her army.",
    "event_1": {
      "text": "Jekserah has unfortunately had ample time to reanimate the corpses here, but they are no match for your skills. You knock down one last door to come face - to - face with the necromancer herself.\n\"I don't know how you found me, but it matters little. You have mistakenly assumed that I ran because I was afraid to fight you. I was just holding out some hope that you would come to your senses in time.It is a pity that your minds cannot think beyond what is at the end of your blades.What corpses you have destroyed so far will now be replaced with your own.\"",
      "boss_special_1": "Jekserah summons two normal Living Bones for two characters, one normal and one elite Living Bones for three characters, or two elite Living Bones for four characters.",
      "boss_special_2": "This is the same as Boss Special 1, except that Living Corpses are summoned instead of Living Bones."
    },
    "conclusion": "Jekserah collapses, the life fleeing her eyes. \"I...\" she whispers at you. \"You have no idea what s coming...\" (28)\nWith one more hack of your blade, you separate her head from her body and hastily leave the wretched place full of mangled corpses. You return the head to the Captain of the Guard and are paid handsomely for the bounty on her.\n\"If you are interested, I may have some more work for you,\" he says grimly.\n\"First of all, we ve had reports from northern scouts of sightings of a large flying creature. They re afraid of dragons. \"He shakes his head in annoyance.\"I d like you to head to the northern pass and investigate.\" (16)",
    "rewards": ["20 gold each", "+2 reputation", "+1 prosperity"],
    "tiles": ["J1a", "K1a", "C1a", "D1a"]
  },
  {
    "id": 21,
    "title": "Infernal Throne",
    "anti_requirements": ["The Rift Neutralized"],
    "global_achievements": ["The Rift Neutralized"],
    "conditional_achievements": ["Artifact: Recovered"],
    "goal": "Kill the Prime Demon",
    "board_square": "C-7",
    "tiles": ["E1a", "J1a", "J2a", "D1a", "D2a"],
    "introduction": "Before you can even reach for your weapons, the demon senses your intent.\n\"Fools!\" His voice tears at your skull and you reel in pain. \"You dare go against me in my own seat of power? You have made a grave mistake this day!\"\nIn a burst of flame, his massive form vanishes into the darkness.\"To me, my servants! Grind these mortals into the stone.Decorate my palace with their entrails!\"",
    "event_1": {
      "text": "You lift back the veil of darkness to reveal the main room of the palace. In the center, you see the huge demon laughing. \"You should have fled my realm while you had the chance, worms. In this place, you cannot possibly harm me.\" He places a giant, clawed hand upon an altar of black glass in front of him. A swirling rift of chromatic energy emerges and pulses, bathing the demon in an aura of protection.",
      "special_rules": "The Prime Demon and the altar (a) share hit points, initiative, and immunities. The Prime Demon cannot be damaged in any way. Instead, damage must be done to the altar.",
      "boss_special_1": "The altar jumps to the next hex in the order  of (a), (b), (c), (d), (e), (f) and then back to (a). If the hex is occupied by a figure or other overlay tile, that figure or tile is moved to the nearest unoccupied hex. If the altar moves into an unrevealed room, that room is immediately revealed, opening all doors between it and other revealed rooms.\nThe altar then summons one normal demon for two characters or one elite demon for three or four characters.The type depends on the location: (a) Frost Demon; (b) Wind Demon; (c) Night Demon; (d) Earth Demon; (e) Flame Demon; (f) Sun Demon.\nThe Prime Demon then performs \"Move + 2,Attack - 1.\"",
      "boss_special_2": "This is the same as Boss Special 1, except that the demon summoned is normal for two or three characters or elite for four characters"
    },
    "conclusion": "With one final blow, the rift grows chaotic, spinning wildly and shooting tendrils of energy out at odd angles.A sharp whine emerges from it that increases in intensity until the sound echoes throughout the palace. In a brilliant flash of light, the void collapses in on itself and then explodes outward, sending a shock wave that destroys all demons in its path.\nAs the wave hits the Prime Demon, his aura dissipates and a scream pierces your mind. His legs buckle underneath him and he collapses on the floor, crashing into countless shards of stone.\nAs this happens, the screaming stops and the palace grows oddly quiet.With the threat destroyed, the only sensible thing left to do is loot the place and make your way back to your own plane.",
    "rewards": ["50 gold each", "+1 prosperity", "Add City Event 78 to the deck"]
  },
  {
    "id": 22,
    "title": "Temple of the Elements",
    "requirements": ["A Demon's Errand"],
    "alt_requirements": ["Following Clues"],
    "global_achievements": ["Artifact: Recovered"],
    "new_locations": [31, 35, 36],
    "board_square": "K-8",
    "goal": "Destroy all alters (a)",
    "introduction": "Your road has led you here to the Temple of the Elements in search of an ancient artifact. It apparently holds great power, but anything more than that is very foggy at this point. You enter the decaying stone structure to see for yourself what all the fuss is about.\nAs you step inside, your eye catches signs of recent visitors a broken twig, footprints in the dust.You approach the main chamber and ready your weapons as a group of hooded figures emerge from the shadows.\n\"You re too late, fools. We control this temple now, and all its power serves us.\"",
    "event_1": {
      "text": "Moving on from the entrance chamber, you find a large central room with many exits. In the center stands another group of cultists, preparing incantations around a reddish clay vessel, roughly the size of a skull.\n\"The artifact is ours, and it has made our minions more powerful than ever.You cannot hope to stop what is coming.Even if you strike us down, the Gloom will bring forth your end.\" The cultists raise their hands and a barrier surrounds the artifact.",
      "special_rules": "Each altar (a) has 4+(C*L) hit points. For each altar that isn t destroyed, regardless of whether it has been revealed, the maximum hit point and attack values of all demons is increased by 1 and their movement and range values are increased by 0.5(rounded up). Melee attacks do not increase in range."
    },
    "conclusion": "With the altars smashed, the demons vanish and the protective barrier around the artifact finally dissipates.You approach the center of the temple and reach out for the vessel but stop short. You feel a powerful darkness emanating from the thing, and behind that, a deep sadness.\nThis artifact has been corrupted, and it seems to almost be cognizant of that fact. All of these feelings flash in your mind as a warning.It could be used for great evil.but would you fight for that evil (35) or against it? (36)\nAfter some effort, you use a thick cloth to get the vessel into your bag. Perhaps it would be best to bring it to an enchanter rather than mess with it yourself.(14) (31)",
    "tiles": ["B2b", "M1a", "D1a", "D2a", "C1a", "C2b"]
  },
  {
    "id": 23,
    "title": "Deep Ruins",
    "requirements": ["The Power of Enhancement"],
    "party_achievements": ["Through the Ruins"],
    "global_achievements": ["Ancient Technology"],
    "new_locations": [26],
    "introduction": "Deciding to brave the dark passages beneath the Gloomhaven sewers, you light a torch and head deeper down.Ruined brickwork eventually gives way to passages made of intricate stone in a state of extreme disrepair.\nYou see an unrecognizable runic language etched into the walls.It would be hard to read even if you knew the language because of all the fractures and missing chunks of stone.\nFollowing the passage, you eventually make your way to a larger room full of ruined machinery you cannot begin to understand. You see a door on the opposite wall, but as you step forward, a clanging sound rings out through the room, almost like an alarm. Then the machinery moves and springs to life, clearly intent on attacking any intruders. That would be you.",
    "board_square": "C-15",
    "goal": "Occupy all pressure plates simultaneously",
    "tiles": ["I1b", "K2b", "D1a", "M1a"],
    "special_rules": "Add three -1 cards to each character's attack modifier deck as a scenario effect",
    "event_1": {
      "text": "You fight your way through the room of machinery and find corridors heading to your left and right.You hear the alarm ringing from both directions.To shut it off, you may have to split up.",
      "special_rules": "There are a number of pressure plates equal to the number of characters. For two characters, the plates (a) exist.For three characters, the plates (a) and (b) exist.For four characters, the plates (a), (b), and (c) exist."
    },
    "conclusion": "With the last switch depressed, the alarm finally, thankfully, subsides.The cannons lights go off and their guns point downward, lying dormant.The machinery sputters and dies, the cogs stopping their rotation. Within a matter of seconds, the entire chamber becomes as dead as it was before, leaving you to continue to explore in peace.\nHeading down a narrow passage at the back of the left room, you find the corridor descends into a pool of brackish liquid.You can see a vague light in the distance under the water.A quick swim should take you farther into this underground world.26"
  },
  {
    "id": 24,
    "title": "Echo Chamber",
    "party_achievements": ["The Voice's Command"],
    "new_locations": [30, 32],
    "board_square": "C-6",
    "goal": "Open all doors (fog tiles)",
    "introduction": "You step into the cave, heeding the call of a voice in your head.It is alluring, with an edge of danger.You could be walking into a trap, a hapless lamb in some sinister game. Reading these fears, the Voice issues you calm assurances.Everything will be fine, just continue descending into the darkness.\nAgainst all reason, you continue.\nIn flashing images and thoughts, the Voice attempts to explain itself.It has been trapped by some powerful force deep in the earth. It needs your help to get out.You express curiosity about who imprisoned it and why, but the Voice falls silent at the thought.\nAnd that silence is troubling, deep in the dark.You are hopelessly lost, until the Voice returns and continues to direct you, with no answers to your questions. The Voice flashes images of the monsters placed to guard it.And it gives you a plan: if you can connect all the rooms in its chamber, its voice will be able to resonate and take form once again, giving it the ability to banish its captors.\nThe Voice tells you you are near.It tells you to prepare yourself",
    "conclusion": "The last of the fog dissipates and a wind immediately picks up, circulating throughout the chambers of the prison.Its speed grows rapidly, starting as a breeze and escalating to a cyclone in a matter of seconds.\nAnd then you hear the Voice: a sound carried on the wind a great and terrible sound. There is a powerful cry and all the remaining monsters are destroyed disintegrated and scattered among the storm.\n\"Thank you, my friends.It is good to finally be rid of those pests.\" The Voice rattles your bones as it speaks. \"And now that that is done, I ask you to aid me again.I am still a prisoner here, trapped in the wind.In order to take a more corporeal form and leave this land, I require my vessels of power returned to me.\"You fall to your knees as the sound subsides, your head ringing from the vibration.The Voice just destroyed your adversaries as if they were nothing.You cannot imagine what it would be capable of if you were to give it more power.\n\"Do not worry, I have no desire to bring calamity to your land.I only wish to be on my way, to be free and unencumbered by this plane.I give you now a vision of where you can find the first vessel.They thought to hide it from me, but I can see it as if it were right in these chambers. Please, bring it to me.\"\nIn a show of goodwill, the Voice directs you back to the entrance of the cave.Far away from its influence, you have a decision to make.You can do its bidding, (32) or you can try to get to the bottom of what exactly the Voice is instead of just meddling with powers you do not understand.(30)",
    "tiles": ["L2a", "A2b", "G2a", "J1b", "D2b", "B4b"]
  },
  {
    "id": 25,
    "title": "Icecrag Ascent",
    "party_achievements": ["The Drake's Command"],
    "new_locations": [33, 34],
    "board_square": "A-5",
    "tiles": ["K2a", "N1a", "G2a"],
    "goal": "All characters must escape through the exit (a)",
    "introduction": "The Copperneck Mountains are not accommodating. Beyond the pass, the weather gets progressively worse the farther north you travel. Your packs are unbearably heavy. The cold is in your bones. And then you start climbing the Icecrag.\nWithout yet having seen any signs of a giant, winged beast, you begin to wonder whether all this trouble is even worth it. Multiple times you contemplate turning back, dreaming of the warm glow of the Sleeping Lions hearth.\nBut you begin to hear something strange. Your ears pick up a screeching sound in the wind. It is not largepossibly even just the wind flowing through a small space. But still, it is something. You move forward, and then you see the wolves. They are right upon you, white fur among the flurries of snow.",
    "special_rules": "Add two -1 cards to each character's attack modifier deck as a scenario effect\nEscape occurs when all characters are either standing on an exit or have become exhausted while standing on an exit . If any character becomes exhausted while not occupying an exit , the scenario is lost.",
    "event_1": {
      "text": "You get through the wolves, thankful that the snow didn t slow you down too much.You assume the fight is over, but the screeching begins again, this time much closer.You look through the white storm and see red shapes scurrying toward you."
    },
    "conclusion": "Everything within you wants to stopto fall over and rest in the snow. But you know you wouldnt get up. You know you would get torn to pieces by giant, red claws. So you press forward, beyond all reason. Until, finally, the drakes stop pursuing and the mountain summit is in sight.\nThe wind calms as you approach the peak. It is a nice change from the torrent of biting pain that came before. The air is thin, but you are above the clouds now and so the weather is relatively peaceful. It makes it very easy to see the giant, winged lizard perched atop a jagged boulder.\n\"Welcome to my mountain, intrepid adventurers.\" A gravelly voice booms forth from the creature, surprising you with its eloquence.\n\"I hate to back you into a corner, but now that you have come to me, face-to-face, your options are unfortunately limited. I am not particularly hungry at the moment, so I could be convinced to let you live, if you agree to help me in a small matter.\n\"A group of Savvas subdued me in my sleep and removed one of my flame glands, presumably to study. I cannot let this insult go unpunished and would greatly appreciate you taking it back from their city, killing as many of them as you can in the process.\" The drake clacks its claws against its stone perch in anger. (33)\n\"Or, if you wish to be clich,\" the creature says with a sigh, \"you could simply attack me. Slay the dragon, save the princess, and all that.\"\n\"Except I have no princess, and Im not a dragonjust a drake who has lived a long time and does not wish to end his life today. So if you do attack me, I will fight back, and you will most assuredly die. (34)"
  },
  {
    "id": 26,
    "title": "Ancient Cistern",
    "requirements": ["Water-Breathing"],
    "alt_requirements": ["Through the Ruins"],
    "party_achievements": ["Following Clues"],
    "new_locations": [22],
    "board_square": "D-15",
    "goal": "Cleanse all water pumps",
    "introduction": "The water grows dark, black as a cloudy night sky. You cannot see your hands paddling in front of your face, but you press on. Before too long, you spot a light in the distance. It takes all the effort you have left, but eventually the light grows bigger and you emerge from a pool of fetid water, grateful that you can breathe freely once again.\nThe relief, however, is short-lived. The room is swarming with menacing green masses of ooze and undead. You flop out onto dry land and try to catch your breath, readying your weapons for another battle.",
    "special_rules": "Add three CURSE (CURSE) cards to each character's attack modifier deck as a scenario effect.",
    "event_1": {
      "text": "Following the signs of corruption, you find your way into the final room of the chamber, hoping to finish off the rest of your adversaries quickly. Instead, horror invades your mind as you view the scene before you.\nFour water pipes stand vertically in the back of the room, clear conduits for the pumping of the citys water. Attached to the pipes, however, are writhing black masses, poisoning the water running through. When you enter, some of the black mass drips down from the pipes, coalescing into the forms of small, bulbous imps with mouths full of teeth.\nThe horde of demons and undead isnt exactly a welcome sight, either.",
      "special_rules": "A number of water pumps equal to the number of characters are present and must be cleansed to complete the scenario. Any character adjacent to a water pump may forgo a bottom action (discarding one card instead) to cleanse the pump. For two characters, pumps are located in water hexes (a). For three characters, pumps are located in water hexes (a) and (b). For four characters, pumps are located in water hexes (a), (b), and (c). At the end of each round, all pumps that have not been cleansed summon one normal Black Imp."
    },
    "conclusion": "By the time the fight is over, the walls and floor are a mess of black ooze. None of it is pulsating anymore, though, which is a step in the right direction. A simple mop can clean the remnants, now that the dark presence has been removed.\nYou approach the back wall and bemusedly wipe away some of the grime with your finger. Most of it comes off easily, but a chalky black streak remains. Curious, you take your sleeve and begin wiping the wall more vigorously, quickly revealing some sort of runic language. With enough cleaning, you find lettering covering the entire back wall.\nThe letters are unrecognizable, but you jot them down and head back to town, bringing the writings to a language expert at the University.\n\"Its part of a ritual,\" says a bespectacled Quatryl, staring down at your crude writing. I am not myself entirely familiar with the specifics, but it seems to be a ritual to welspar...err, corrupt.\nI believe such corruption would require the use of a conduit. The Quatryl peers even more intently at the writings. Ah, here! Something referred to as The Artifact, housed at the Temple of Elements\nThe Quatryl rushes over to a bookcase overflowing with texts, Ah, interesting! Ive heard of that before. He disappears behind a large stack of tomes.\nYes! The Temple of the Elements. His head pops out above the books. The Temple of he Elements, said to house the Vessel of the Elements, a powerful ancient artifact capable of giving shape and power to the elemental residues around us.\nThe book says the temple isnt even that far from heresomewhere around the fork in the Serpents Kiss River. If youre looking to get the bottom of the corruption, Id start there. (22)",
    "rewards": ["10 gold each", "+1 reputation", "+2 prosperity"],
    "tiles": ["M1a", "J1a", "C1a", "L2a"]
  },
  {
    "id": 27,
    "title": "Ruinous Rift",
    "requirements": ["Stonebreaker's Censor"],
    "anti_requirements": ["Artifact:Lost"],
    "global_achievements": ["The Rift Neutralized"],
    "board_square": "E-6",
    "goal": "Protect Hail (a) for ten rounds",
    "introduction": "On the way back to the Ruinous Crypt, Hail seems almost happy as she trudges through the mud with you, eager to help fight back demons and undead.\nIts been so long since Ive been outside of Gloomhaven, she says, swaying the elemental censer back and forth as she walks. The city is necessary for my studies, but it feels good to take a small break and travel this plane again. And with so much less danger this time, as well.\nYou look at the Aesther questioningly. Sure, cultists and demons arent exactly friendly encounters, but last time I traveled these lands...well, that is something I swore I would never speak of.\nHail grows silent until you arrive at the crypt. Opening the ancient doors, you half expect the place to be teeming with cultists and demons once again, but the stone halls are as silent and barren as death. You move towards the main chamber where you find the giant rift, hovering above a demonic altar.\nWell, you certainly werent kidding, Hail says. This thing is a beauty! The girth and stabilityquite impressive! Hail walks around the perimeter of the altar, throwing sand in the air and watching it fall.\nIm pretty sure I can close it, thanks to old Stonebreakers censer here. I cant imagine the forces on the other side of this rift are going to be all too happy about it, though.\nHail raises the censer above her head with one arm and plunges the other elbow-deep into the rift. Gather round, ladies and gentlemen! This is going to be one killer party.",
    "special_rules": "Hail (a), represented by a numbered token, has 4+(2xL) hit points. She is an ally to you and an enemy to all monster types. She has an initiative of 99 for the purpose of monster focusing. If Hail is killed, the scenario is lost.\nAt the end of the first round, one demon spawns on hex (b). At the end of the second round, one demon spawns on hex (c). At the end of each round after the second, two different demons will spawn at (d) and (e)at the end of every odd round, and at (b) and (c) at the end of every even round.\nThe type of demon that spawns cycles in the order of Night Demon, Wind Demon, Frost Demon, Sun Demon, Earth Demon, Flame Demon and then back to Night Demon. All spawns are normal for two characters. Wind, Sun and Flame Demons are elite for three characters. All spawns are elite for four characters.",
    "conclusion": "Hail screams out with hair-raising intensity. You look to her, afraid that more demons got past you and are attacking her. Instead, you see her pulling her hand back out of the rift. Her forearm is withered and smoking.\nAs her gnarled fingers clear the chaotic energies of the rift, it wavers and begins to shrink. A great wind picks up in the chamber and the demons fighting with you show fear for the first time. Instead of digging their claws into you, they grab at the stone floor, desperate to stop the pull of the rift.\nTheir efforts are futile, however. Every last one is sucked back into their own plane. The tear shrinks to one brilliant point and disappears.\nHail collapses, and you run to her side. Oh, dont mind me, she coughs. Ill be fine. This old body has seen far worse.\nShe breaks into a fit of coughing, that soon turns into laughter. That really was something, though, wasnt it? If theres one thing I can depend on you for, its a challenge.\nHere, help me up. I need to get back to Gloomhaven immediately. I have many new thoughts for my research. Feel free to come by any time and Ill figure out some way to properly thank you.",
    "rewards": ["+1 prosperity", "100 gold each (This money must immediately be spent on enhancements)"],
    "tiles": ["M1a"]
  },
  {
    "id": 28,
    "title": "Outer Ritual Chamber",
    "requirements": ["Dark Bounty"],
    "party_achievements": ["An Invitation"],
    "new_locations": [29],
    "board_square": "C-4",
    "goal": "Kill all enemies",
    "introduction": "As you enter the crypt, a familiar face greets you at the bottom of the stairs. He grins from ear to ear. Ah, so you have come. Again, we thank you graciously for your help in taking out that pesky necromancer. Come, let me make introductions.\nThe hooded figure leads you through a stone door and into a large room. He points at a black, flaming rift in space.\nThis, he says, failing to mask his giddiness. Is our master: the Gloom. It wanted to thank you personally for murdering so many of our brothers and setting back our plans.\nOut of the rift, a group of horrendous, bloated corpses appears and shambles toward you.\nYou are worthless fodder! The figure suddenly screams in exhilaration. Did you think you could come back into our graces so easily? You are here to die! Then you can join our cause as a corpse, just like the rest of these unworthy fools!",
    "special_rules": "All Living Corpses are two levels higher than the scenario level, up to a maximum of 7",
    "conclusion": "You drop your weapons, exhausted. Thankfully, no more undead seem to be coming through the rift, but still, its existence and the presence of this Gloom is troubling.\nYou have done well. A cold, low voice penetrates the silence. It seems to be coming from the darkness in front of you. My minions may not be able to forgive. But I can.\nCome. Come to me. Step into my realm. Embrace the inevitable.\nThe rift stands before you. You can see this through to the end, (29) or you can turn around and leave this place, ignoring the call of the Gloom.",
    "tiles": ["M1a", "C1a", "C2b"]
  },
  {
    "id": 29,
    "title": "Sanctuary of Gloom",
    "requirements": ["An Invitation"],
    "global_achievements": ["The Edge of Darkness"],
    "board_square": "E-3",
    "goal": "Kill all enemies",
    "introduction": "Within the cultist sanctum, you step into the black rift. After a blinding pain and flashing images of clawed demons and flayed corpses, you end up in a place much like the one you left. A large stone room is visible before you.\nTricked again. The low voice returns to you. Truly amazing that creatures as stupid as yourselves have caused me so much trouble. No matter. You will rot here, completely cut off from your home. In an instant of dread, you turn to see the rift that brought you here shrink and close.\nThere will be no last stand. You will simply waste away. You will die without valor in a foreign place and there is no recourse. I leave you now forever. Good-bye.",
    "special_rules": "Add three -1 cards to each character's attack modifier deck as a scenario effect\nDoors (a) are locked and open when they are destroyed.They have 4 + L hit points.",
    "conclusion": "You bang on the walls, desperately hoping for something to continue fighting against in this exile. You grow tired. Your vision darkens.\nIn your next breath, you find yourself lying in the grass outside of the cults hideout.\nKnow that I have spared you. The low voice returns. Your persistence intrigues me. I invite you to break yourself against me. It will be more entertaining than the last time I brought gloom to this world.\nYou bolt upright and rush back into the crypt. Dead bodies of the cultists litter the floor.\nI am not here anymore. These shells have served their purpose. My roots are now deep and you will soon encounter my endless power once more. I look forward to the day.",
    "rewards": ["15 experience each"],
    "tiles": ["E1a", "D1a", "D2a", "J1a"]
  },
  {
    "id": 30,
    "title": "Shrine of the Depths",
    "requirements": ["The Voice's Command"],
    "party_achievements": ["The Scepter and the Voice"],
    "new_locations": [42],
    "board_square": "N-15",
    "goal": "Loot the treasure tile",
    "introduction": "So, theres a disembodied voice somewhere deep in the Copperneck Mountains, and it wants you to collect vessels that will help it escape its confinement? A bookish Quatryl at the University adjusts his glasses to look up at you. And you want to know exactly what this voice is?\nHe laughs nervously. Heh, okay, well, Ill do what I can. Ill start with rituals that could separate a voice from its host... The Quatryl sort of drifts off in the middle of his sentence and wanders over to some bookshelves, where he leafs through various texts.\nYou decide to head to the market for a few hours. When you return, the Quatryl rushes up with excitement.\nIve found it! He waves a book in your face. I hit a number of dead ends until I realized the voice wasnt separated, it was just the only thing that can get through the barrier created to imprison it, which implies that the barrier itself was extra-planar, most likely created by the Aesthers ages ago.\nSo I did some digging through all the texts we have on Aesther ritualswhich isnt much, theyre very reticent about such thingsbut luckily I found this book. It is a specific recounting of the binding of a demon in the Copperneck region you referred to. Apparently the creature was so strong, the Aesthers enlisted the help of the Savvas and the Harrowers, too. They claim it was powerful enough to lay waste to the entire continent.\nIf its asking you to help free it, Id strongly recommend against it. The accuracy of the text is admittedly a little questionable, but whatever this voice is, it was bound for a reason.\nThe Quatryl finally stops waving the book around and begins to flip through the pages. In fact, if you can hear the voice from outside the cave, and it has such a strong influence over you, it sounds as if the barrier is weakening, as the author warns.\nApparently there is a scepter that could be used to strengthen the binding ritual, but the author says it has been placed on an island along the south shore for safekeeping. Theres a simple incantation detailed in the text to open the door to the shrine.\nTwo days later, you stand before the ruined structure, which now sits half-sunk in the water-logged earth. You speak a few foreign words and the door creaks open. You get the strong sense that the door is not the only thing between you and this scepter.",
    "tiles": ["E1a", "L1a", "N1b"],
    "special_rules": "The treasure tile can only be looted using a Loot action. It cannot be looted by normal end-of-turn looting.",
    "conclusion": "You grab hold of the scepter and the entire building shudders violently. A dark energy bursts forth, piercing through the chests of the monsters still attacking you. They all fall over dead and the shuddering stops.\nAs you get back to your feet, however, a sharp pain suddenly pierces your skull.\nYou have been misled, the Voice speaks into your mind. Do not bring that scepter to me! If you free me, I guarantee no harm will come to you. But I cannot say the same if you approach with the scepter. Whatever you think you are doing, you are wrong.\nAs quickly as it came, the pain stops. You tighten your grip on the scepter and race out of the shrine, eager to bring it to the Echo Chamber and silence the Voice. (42)",
    "rewards": ["10 gold each"]
  },
  {
    "id": 31,
    "title": "Plane of Night",
    "requirements": ["The Power of Enhancement", "Artifact: Recovered"],
    "global_achievements": ["Artifact: Cleansed"],
    "new_locations": [37, 38, 39, 43],
    "board_square": "A-16",
    "goal": "Destroy the rock column (a)",
    "introduction": "Hail rubs her hands in excitement.\nOn this day, I can tell you that, for the first time, I do not regret turning you inside-out when we met, she says matter-of-factly. The Vessel of the Elements! And you say it was under my nose the whole time? Amazing how some things get forgotten so easily.\nShe reaches out to touch it, but quickly recoils her hand. Oh, so this is why you brought it to me? And here I thought it was a token of friendship. She frowns.\nThat, she says, pointing at the artifact, is a clear case of bad gifting. Youre going to have to clean this thing out before I can accept it.\nThe artifact has been attuned to the Plane of Night, capable only of corrupting and destroying everything it comes in contact with. You could wreak a lot of havoc with this, but with such strong attunement, theres noway to control its power. Youll need to break the connection to balance it out.\nYou stare at Hail blankly. Oh, what, do I have to do everything? she asks incredulously. Okay, look, Im not going to go in there and fix it, but I suppose I can transport your essences through to the other side so that you can sever the shadow link yourselves.\nHail begins to move her hands fluidly back and forth. Occasionally a hand disappears down to her wrist, only to re-emerge, clutching colorful magics, which she begins to scatter over you.\nSo its all very simple. Soon you will find yourselves in the Plane of Night. Just look around for a giant black pillar extending infinitely into the sky, and then destroy it. Once you do that, Ill bring you back here.\nBefore you even have time to object, your vision goes dark. At first you feel as though you are falling, but then realize you are standing on solid ground. Your vision adjusts, and you begin to see features in your surroundings. You are in a cave, covered in a slick, black slime. And there are demonsso many demons",
    "special_rules": "Add three CURSE (CURSE) cards to each characters attack modifier deck as a scenario effect. At the start of every round, move the Dark elemental token to the Strong column and move the Light elemental token to the Inert column.",
    "event_1": {
      "text": "Just as you are beginning to think that Hail sent you to the wrong place, you gratefully see the outline of a tower in the distance. The thing is massive, with twisting ropes of darkness weaving in and out of one another, reaching up through an opening in the cavern ceiling above you.",
      "special_rules": "The rock column (a) has (8+L)xC hit points.\nStarting from the current round, at the end of every odd round, one normal Night Demon for two or three characters, or one elite Night Demon for four characters will spawn in hex (b). At the end of every even round, one normal Night Demon for two characters, or one elite Night Demon for three or four characters will spawn in hex (c)."
    },
    "conclusion": "With one last swing, the tower of black rope severs. The strands writhe and whip around, quickly ascending out of the cave, as if falling away up into the sky. The ground shudders. Cracks form beneath your feet, and there is a loud grating noise as the whole chamber shifts and begins to crash downward.\nAs true panic sets in, you are whisked back into the Crooked Bone with Hail standing in front of you.\nOh my, that connection receded much more quickly than I had anticipated. Youre quite lucky I was able to pull you out of there before the whole place collapsed in on itself.\nThe attunement has certainly been severed, though. The artifact is perfectly balanced. Hail picks up the vessel with her hands and studies it closely. A true marvel.\nAll fun aside, though, if youre looking for the entity who could have attuned it in such a way, I may have something for you there. She sets down the vessel and pulls a map out of the air, laying it on a rickety table. After the connection to the Plane of Night was severed, I briefly felt a tug on the artifact from three different locations. It was being used as a power source, but with the source depleted, the tugging stopped almost immediately.\nI was still able to pinpoint the locations, Hail states triumphantly, marking the map. Here, out in the Misty Sea, deep under the surface. (43) (37) Another one in the dark parts of the Dagger Forest. (38) And finally one high atop the peaks of the Coppernecks. (39)\nHail straightens up and reaches for the artifact. Ill keep this safe here.\nYou look at her disapprovingly. Okay, fine, she says. You can hold on to it. Probably safer with you anyway. Just promise youll let me take a closer look at it some time.",
    "tiles": ["G2a", "J1b", "L2a"]
  },
  {
    "id": 32,
    "title": "Decrepit Wood",
    "requirements": ["The Voice's Command"],
    "new_locations": [33, 40],
    "board_square": "L-11",
    "goal": "Revel the G tile, kill all revealed enemies, and loot the treasure tile",
    "introduction": "The thick wood recedes as you close in on the location of the first vessel of the Voice. Through the trees, you see a decaying wooden structure with collapsed walls and a rot that seems to be seeping into the surrounding area. The trees and plants around the building are equally forlorn and decayed.\nThe Voice claims the place is home to a sect of militaristic Harrowers, highly aggressive and territorial. No one would dare get close to this area unless they had an extreme death wish.\nSo theres nothing left to do but kick down the door and find the vessel somewhere in the Harrowers coffers. Alternately, youve scouted a side entrance that could let you avoid some confrontation, but may lead to other dangers.",
    "tiles": ["H2b", "I1a", "L1b", "A4a", "G2b"],
    "conclusion": "The Harrowers proved quite difficult to take down, but in the end they fell just like any other foe. Feeling the rot of the place seeping into your bones, you hurriedly ransack the dwelling and locate the small earthen pot shown to you by the Voice.\nWhen you pick it up, the Voice fills your head. Good! Yes, excellent! The infesters were but one guardian employed to block my passage. I give you now the second location. (33) Please bring the vessels back to me. I will reward you greatly. (40)"
  },
  {
    "id": 33,
    "title": "Savvas Armory",
    "requirements": ["The Voice's Command"],
    "alt_requirements": ["The Drake's Command"],
    "party_achievements": ["The Voice's Treasure", "The Drake's Treasure"],
    "board_square": "A-7",
    "goal": "Loot all treasure tiles, then all characters must escape through the exit (a)",
    "introduction": "Commanded by a powerful creature to retrieve a priceless treasure, you now plot how to infiltrate a Savvas city and break into an armory deep inside their mountain.\nAssaulting the Savvas directly is hopeless, the creature told you. But there is a passage on the north side of their city that leads directly to their vault.\nIts a long, harrowing journey, navigating to the far side of the mountain, but eventually you find the hidden entrance.\nYou will need to act quickly, the creature instructed. As soon as you enter, the Savvas will sound an alarm. Youll need to get what you came for and get out before you are overwhelmed by reinforcements.\nYou reach a simple wooden door at the end of the tunnel. Carefully trying the door, it doesnt budge. Its rather flimsy, so you should be able to break it down easily, but youll have to abandon a stealthy approach.",
    "special_rules": "Door (b) is locked and opens when it is destroyed. It has 4+L hit points.\nDoor (1) is locked and opens when all characters simultaneously occupy one of the pressure plates (c) at the end of a turn.",
    "event_1": {
      "text": "You hear the alarm ringing clearly in the distance. Youve kicked over a hornets nest and its just a matter of time before you are swarmed. You enter the inner chamber and scan the room. Theres a lot of treasure here. Best just to grab it all.",
      "special_rules": "At the end of the current round, one normal Savvas Lavaflow for two characters or one elite Savvas Lavaflow for three or four characters will spawn in hex (a). At the end of the round in which the last treasure tile is looted, one normal Savvas Icestorm for two or three characters or one elite Savvas Icestorm for four characters will spawn in hex (a). Escape occurs when all characters are either standing on an exit (a) or have become exhausted while standing on an exit (a). If any character becomes exhausted while not occupying an exit (a), the scenario is lost"
    },
    "conclusion": "You round the corner just as a ball of fire flies in your direction. It explodes on the far wall and collapses the tunnel behind you. You break into a full sprint and, within minutes, emerge from the mountain and continue speeding into the surrounding foothills. With a safe distance between you and your pursuers, you finally collapse to the ground and rest. After a while, it becomes clear that no Savvas are chasing you, so you get up and continue your quest with the treasure in hand. (40)",
    "tiles": ["A3b", "A4b", "C2b", "I1b", "M1a"]
  },
  {
    "id": 34,
    "title": "Scorched Summit",
    "requirements": ["The Drake's Command"],
    "anti_requirements": ["The Drake Aided"],
    "lost_achievements": ["The Drake's Command"],
    "global_achievements": ["The Drake Slain"],
    "board_square": "A-4",
    "goal": "Kill the Elder Drake",
    "introduction": "Standing before the great, proud drake, you see nothing to discuss with the monster. If it wants your help, it is certainly for a nefarious purpose. The drakes youve met previously certainly havent been very kind. You ready your weapons with determination.\nSo, its to be that way is it? The drake sighs. Well, I suppose I could eat, if you insist. It takes in a deep breath.",
    "special_rules": "The Elder Drake occupies all three hexes of the obstacle it is on. If a figure can target any one of these hexes, they can target the Elder Drake, and the Elder Drake can use any of its hexes to determine what it can target.\nThe Elder Drake cannot be forced to move or change positions in any way. The huge boulder obstacles cannot be destroyed.",
    "boss_special_2": "The Elder Drake summons two Zephyrs, represented by numbered tokens, then flies to the next perch of boulders in the order of (a), (b), (c), and then back to (a).\nZephyrs cannot be damaged in any way. They perform Move 2, Attack C immediately before the Elder Drakes turn every round.",
    "conclusion": "With one final blood-curdling screech, the giant drake falls off its perch and crashes to the snowy ground. It appears to still be alive, but its breaths are weak and shallow.\nBloodthirsty and obtuse. I dont know why I should have expected more, the drake whispers. Congratulations on your stunning success. Im sure you will be heralded as heroes upon your triumphant return. Adorned in crowns of gold and cloaks of silk. Riches will be laden upon you and five thousand...\nThe drakes whispers trail off and the breathing stops. Needless to say, the drakes sarcastic predictions do not come to pass. You report your deeds to the Gloomhaven authorities and receive a modest reward to add to the modest amount of treasure you found on the scorched summit.",
    "rewards": ["20 gold each", "+2 reputation", "+1 prosperity"],
    "tiles": ["L2a", "L3b"]
  },
  {
    "id": 35,
    "title": "Gloomhaven Battlements A",
    "requirements": ["A Demon's Errand"],
    "anti_requirements": ["The Rift Neutralized"],
    "lost_achievements": ["A Demon's Errand"],
    "global_achievements": ["City Rule: Demonic", "Artifact: Lost"],
    "new_locations": [45],
    "board_square": "A-14",
    "goal": "Destroy door (1) and kill the Captain of the Guard",
    "introduction": "Ah, wonderful! You have returned with the artifact. The massive demon clutches it, his claws clacking against the metal vessel. It looks so small in his hands, but somehow the demon looks small holding it.\nWith this we are ready to make an assault against your realm. Come! Help me fight against the humans and I will set you at my right hand, where you will earn many riches. What say you?\nYou smile and nod. Finally you will get the recognition you deserve.\nGiant winged creatures swoop down and grab you with their talons. A massive force of demons rushes towards the rift into your plane. Once through, they quickly make their way to the city walls of Gloomhaven. The intimidating figure of the Prime Demon marches to the front.\nHear me, denizens of this pathetic world! The time of demons is upon you once again! Relinquish your city to me and you may yet live. The only ones I wish to kill are those foolish enough to oppose me.\nWe will never fall! At the top of the Old River Gate, you see the small figure of the Captain of the Guard. You underestimate our power, and that will be your undoing! He makes a small gesture, and with a crack, a huge ballista bolt sprouts from the Prime Demons chest.\nHrruugh! The demon staggers back. Away from my throne, I am unfortunately vulnerable. It breathes heavily. Take my place at the head of my army. Crush this wall and bring me that humans head!",
    "special_rules": "Door (1)is locked and opens when it is destroyed. It has (7+L)xC hit points.\nAll demons are allies to you and enemies to all other monster types. They still act normally, following the actions of a monster ability card each round. If, on any demons turn, it can move within range to attack the door, it will focus on the door and act out its turn normally. Otherwise, it will choose its focus following normal rules.\nSet up the City Archers grouped at (a) and (b) at the beginning of the scenario. Do not set up the other enemies on the B and I tiles until either the door (1)is destroyed or a character or character ally moves onto tiles B or I, at which point normal room reveal rules are followed.",
    "event_1": {
      "text": "As you hack away at the wooden door, an explosion erupts from it, sending gouts of flame dancing among splinters of wood and shards of rock. A shock wave blows you from your feet and you recover to see nothing but billowing smoke where the door once was. The way is clear. Now its time to bring down the Captain."
    },
    "conclusion": "Traitorous idiots! The Captain spits blood in your face. Youve doomed everyone in this town! Why would you do this?\nA shadow is cast over his fallen body. You look to see the tall, bleeding figure of the Prime Demon standing over him. Wealth, power, all the things you humans scrabble after every day of your miserable lives. These mercenaries, however, were fortunate enough to find someone who would actually give it to them instead of making empty promises.\nI will stay true to my word. Only those who opposed me will die. The rest are free to continue to live and toil in this place under my rule. I will return to my realm and plan my next move.\nOver the next few weeks, the city settles back into its routine. Very little changes, except that demons become an everyday sight in the city and taxes are now given to these overlords instead of the human overlords Gloomhaven had previously.\nOne day, you wake to find a deformed demon standing over you, holding a parchment that looks like some sort of skin. I find myself desiring your help once again, mortals, it reads. It appears that many opposition forces in Gloomhaven escaped my grasp and are now camping out in the southern foothills, plotting to take back the city. Such machinations are surely fruitless, but still it is better to crush them now than to wait to see what they do. (45)",
    "rewards": ["30 gold each", "-5 reputation", "-2 prosperity", "Add City Event 79 to the deck"],
    "tiles": ["L1b", "L3a", "I1b", "B2b"]
  },
  {
    "id": 36,
    "title": "Gloomhaven Battlements B",
    "requirements": ["A Demon's Errand"],
    "anti_requirements": ["The Rift Neutralized"],
    "lost_achievements": ["A Demon's Errand"],
    "global_achievements": ["The Rift Neutralized"],
    "board_square": "B-14",
    "goal": "Kill the Prime Demon",
    "introduction": "Ah, wonderful! You have returned with the artifact. The massive demon clutches it, his claws clacking against the metal vessel. It looks so small in his hands, but somehow the demon looks small holding it.\nWith this we are ready to make an assault against your realm. Come! Help me fight against the humans and I will set you at my right hand, where you will earn many riches. What say you?\nIt slowly dawns on you the many mistakes you have made that have led you to this moment. You never should have brought the artifact. Now he wishes to destroy Gloomhaven, and you must find a way to stop him.\nAs quickly as you can, you turn and run, pulling a crude bomb out of your pack and throwing it at the pursuing demons. You hear a bellowing roar and then a crash as the explosion collapses the hallway behind you. Perhaps you may have enough time to return to the city and warn them.\nYou scramble up the cliffs of the elemental plane and jump through the rift. You race southward, hardly stopping to catch your breath. Eventually, thankfully, the Old River Gate on the north side of the city looms on the horizon. You approach with haste and summon the Captain of the Guard.\nThis is most troubling, he says after you explain the situation. You may have doomed this city with your actions, but you may yet be able to save it.\nA force approaches! You look up at an archer making panicked gestures to the north. Racing to the top of the battlements, you see an army of demons moving toward the gate. The Prime Demon emerges from the armys ranks and bellows out.\nHear me, denizens of this pathetic world! The time of demons is upon you once again! Relinquish your city to me and you may yet live. The only ones I wish to kill are those foolish enough to oppose me.\nWe will never fall! The Captain of the Guard stands next to you on the battlements. You underestimate our power, and that will be your undoing! He makes a small gesture, and with a crack, a huge ballista bolt sprouts from the Prime Demons chest.\nThatll teach him! the Captain shouts at you. Keep them at bay! I must head to the other gates and prepare for assaults there as well. He grabs you with a firm hand. Dont let them through!",
    "special_rules": "Do not set up the Prime Demon. It will spawn at (e) only once door (1) is destroyed. The Prime Demon starts the scenario with twice the number of hit points indicated on its stat card. At the end of each round in which door (1)is not yet destroyed, the Prime Demon suffers (2xC)+L-2 damage.\nDoor is locked and opens when it is destroyed by demons. It has 10+(2xL) hit points. It cannot be healed and is not considered an ally to you. If, on any demons turn, it can move within range to attack the door, it will focus on the door and act out its turn normally. Otherwise, it will choose its focus following normal rules.\nAll City Archers are allies to you and enemies to all other monster types. They still act normally, following the actions of a monster ability card each round. They are set up at the start of the scenario.\nAt the end of each round, one demon will spawn. Starting with (a), they will spawn in the order of (a), (b), (c), (d), and then back to (a). (a) spawns Flame Demons, (b)spawns Earth Demons, (c) spawns Frost Demons and (d) spawns Wind Demons. For two characters, all spawned demons are normal. For three characters, Earth and Wind Demons are normal, Flame and Frost Demons are elite. For four characters, all spawned demons are elite.\nIf, at the end of the eighth round, after the Prime Demon suffers damage, the door is still not destroyed, it is automatically destroyed.",
    "event_1": {
      "text": "With a terrifying roar, the great demon commander leaps forward from the back ranks and lands the final blow against the old gate. It buckles and gives way under his force. He seems winded, though, and is clearly very injured. If you can take him down, the whole attack force should be dispersed.",
      "boss_special_1": "Ignore the special abilities on the Prime Demons stat card. It performs Move+0, Attack+0 for each special instead.",
      "boss_special_2": "Ignore the special abilities on the Prime Demons stat card. It performs Move+0, Attack+0 for each special instead."
    },
    "conclusion": "The demon bellows and falls, shaking the earth as it crashes down. Its clawed hand opens to reveal the artifact. I thought it would give me enough power. I thought it could sustain me on this plane. I was foolish, and now look at me. Broken and destroyed at the feet of mortals. Humiliating. The demon gurgles and goes still.\nThe Captain steps up beside you. The rest of the force is dispersing, he says. It was unpleasant, but we prevailed, thanks to you.",
    "rewards": ["10 gold each", "+4 reputation", "Add City Event 78 to the deck"],
    "tiles": ["L1b", "L3a", "I1b", "B2b"]
  },
  {
    "id": 37,
    "title": "Doom Trench",
    "requirements": ["Water-Breathing"],
    "party_achievements": ["Through the Trench"],
    "new_locations": [47],
    "board_square": "G-18",
    "goal": "All characters must escape through the exit (a)",
    "introduction": "You stare at the first location on Hails map. Out in the middle of the ocean, far beneath the waves. Of course it is.\nYou look out across the endless Misty Sea. According to the map, youve arrived at the proper coordinates. Nothing left to do but shove the water-breathing orb down your throat and dive into the depths.\nUsing small rocks that emanate light, you sink down into the depths. After a few minutes, the extreme discomfort of breathing through the orb gives way to a mere mild annoyance. And still you descend.\nYou hit the bottom of a trench, and shadowy figures emerge from the murky waters. Guardians of whatever you are looking for, no doubt. The last thing you want to do right now is fight, but you must press on.",
    "special_rules": "Add three CURSE (CURSE) cards to each character's attack modifier deck as a scenario effect.\nEscape occurs when all characters are either standing on an exit (a) or have become exhausted while standing on an exit (a). If any character becomes exhausted while not occupying an exit (a), the scenario is lost.",
    "conclusion": "You press ever forward, leaving the wretched trench. Looking behind you, you see the figures of more Lurkers waiting in the shadows, but they do not pursue. Perhaps they are afraid of whatever lies ahead.\nYou go deeper through a crack in the earth until your path shifts suddenly upward. You emerge from the cold, unforgiving water into an air pocket deep beneath the waves. You spit out your water-breathing orb, grateful to finally breathe normally and take a short rest.\nThrough the darkness ahead of you, you see an expansive cavern, which houses a massive stone structure. This unnatural sight, so far removed from anything you are familiar with, fills you with irrational, foreboding dread. (47)",
    "tiles": ["J1b", "H2a", "K2a"]
  },
  {
    "id": 38,
    "title": "Slave Pens",
    "party_achievements": ["Redthorn's Aid"],
    "new_locations": [44, 48],
    "board_square": "G-2",
    "goal": "Kill all enemies and protect the Orchid (a)",
    "introduction": "This section of the forest is a maze of thorns and angry spirits, Hail says, pointing to the second location on the map. Youll never find the corruption on your own. Youll need a guidesomeone who knows the Dagger Forest better than they know themselves. There is a group of native Orchids that may be able to help.\nWhen you arrive at the Orchid camp, however, you find something wholly unexpected. It is a scene of massacre and devastation. Burnedout buildings and disfigured corpses. Judging from the wounds, you figure a raiding party of Inox did this.\nLuckily, Inox dont feel a particular need to cover their tracks. You are able to follow their trail deeper into the woods, where eventually you find a slave labor campInox guards overseeing a group of ragged Orchids and humans working to construct catapults and other machines of war.\nThe camp is not particularly well-guarded from intruders, and, after eliminating a couple key lookouts, you are able to slip into the slave pens and free one of the Orchids.\nYes, I can guide you through the deeper forest, the Orchid says. But I cannot abandon my brethren or let what these Inox are doing go unanswered. He moves over to a guards corpse and picks up a blade.\nYou can help me if you want, but either way, blood must be spilled in this place. The Orchid rushes forward at a group of Inox, yelling wildly. Soon the whole camp is bustling with hostile activity. If you want a guide, it looks as though youll need to keep him alive.",
    "tiles": ["C2a", "A4a", "M1b", "H2b", "D1b"],
    "special_rules": "The Orchid (a), represented by a numbered token, has 6+(3xL) hit points. He is an ally to you and an enemy to all monster types. He acts on initiative 99 each round, performing Move 3 toward the shaman on the D tile, opening doors and springing traps if necessary. If the Orchid is killed, the scenario is lost",
    "conclusion": "With the last of the Inox and their golems dead, the Orchid drops his sword and falls to his knees\nThank you, he says. They killed my family when they came. They said my children were not strong enough workers.\nThe Orchid dips his fingers in a pool of blood and begins to paint his face with it. I thought killing them all would help, but I still feel hollow.\nI owe you a debt for what you have done. I will gladly lead you into the western forest. (48) On the way, however, I would like to check on a neighboring Orchid village. I fear that this may not be the last of the slaving Inox tribe. (44)\nThe Orchid stands and turns to you, his face now a red mask of ferocity and hatred. I am called Redthorn. Follow me.",
    "rewards": ["+1 reputation"]
  },
  {
    "id": 39,
    "title": "Treacherous Divide",
    "party_achievements": ["Across the Divide"],
    "new_locations": [15, 46],
    "board_square": "B-11",
    "goal": "Destroy the alters (a)",
    "introduction": "You climb the frozen peaks of the Copperneck Mountains, lamenting that every location Hail has sent you is in the most unforgiving, inhospitable place possible. As you near the base of the mountain you seek, one of the tallest in the range, you look up at the larger of the two peaks.\nThe massive spire is hopelessly daunting. There is no way to scale it directly. Luckily, the mountains secondary peak has a much more gradual incline. You begin your ascent, hoping that it will be easier to cross over to the main peak once you get higher.\nAs you near the secondary summit, after trekking around the mountain and through the snow, you catch a glimpse of a narrow bridge joining the two peaks. It looks treacherous, with a sheer drop to an icy death on either side. Still, it is better than nothing.\nUnfortunately, you find yourself not alone as you move to the bridge. Figures in dark cloaks and demons made of ice wait for you across the divide.\nA voice booms out over the howling wind. You are not welcome here, mortals. All that awaits you is the embrace of death.\nYou ready your weapons. You can hardly see through the blizzard, but you are determined to make sure death embraces someone else.",
    "special_rules": "Add three CURSE (CURSE) cards to each character's attack modifier deck as a scenario effect.\nAt the start of every round, move the Ice elemental token to the Strong column and move the Fire elemental token to the Inert column.\nThe dark pit obstacles cannot be destroyed.",
    "event_1": {
      "text": "As quickly as you can, you escape the rising storm of ice to find some semblance of shelter in a cave. With every step, the angry wind bites deeper.\nThere are more enemies in the cave, of course, but you are more concerned about the glowing white orb behind the crytalline demons. The pieces all start to fall into place. They are controlling the weather here, blocking your passage to the peak. If you can destroy the orb, you hope the punishing weather will subside.",
      "special_rules": "The altar (a) has 6+(CxL) hit points."
    },
    "conclusion": "Pieces of the shattered orb fall to the snowy floor along with the corpses of the enemies who stood in your way. The screeching of the wind outside the cave lessens to a faint murmur. You exit to see clear skies above you and a path to the peak. (46)\nAt this altitude, without a cloud in sight, you find yourself looking out over the horizon, marveling at the wondrous expanse of mountains and the forests and plains beyond them. You can even see the faint outline of Gloomhaven in the distance.\nLooking to the west, your curiosity is piqued by a lake high in the mountains and a small stone structure resting at its edge. You make a note of the buildingit might be worth investigating in the future. (15)",
    "rewards": ["10 experience each"],
    "tiles": ["L2a", "N1a", "D2b"]
  },
  {
    "id": 40,
    "title": "Ancient Defense Network",
    "requirements": ["The Voice's Command", "The Voice's Treasure"],
    "global_achievements": ["Ancient Technology"],
    "new_locations": [41]
  },
  {
    "id": 41,
    "title": "Timeworn Tomb",
    "requirements": ["The Voice's Command"],
    "global_achievements": ["The Voice Freed"]
  },
  {
    "id": 42,
    "title": "Realm of the Voice",
    "requirements": ["The Scepter and the Voice"],
    "anti_requirements": ["The Voice Freed"],
    "lost_achievements": ["The Voice's Command"],
    "global_achievements": ["The Voice Silenced"]
  },
  {
    "id": 43,
    "title": "Drake Nest",
    "requirements": ["The Power of Enhancement"],
    "global_achievements": ["Water-Breathing"]
  },
  {
    "id": 44,
    "title": "Tribal Assault",
    "requirements": ["Rethorn's Aid"]
  },
  {
    "id": 45,
    "title": "Rebel Swamp",
    "requirements": ["City Rule: Demonic"],
    "new_locations": [49, 50]
  },
  {
    "id": 46,
    "title": "Nightmare Peak",
    "requirements": ["Across the Divide"],
    "global_achievements": ["End of Corruption"],
    "new_locations": [51]
  },
  {
    "id": 47,
    "title": "Lair of the Unseeing Eye",
    "requirements": ["Through the Trench"],
    "global_achievements": ["End of Corruption"],
    "new_locations": [51]
  },
  {
    "id": 48,
    "title": "Shadow Weald",
    "requirements": ["Redthorn's Aid"],
    "global_achievements": ["End of Corruption"],
    "new_locations": [51]
  },
  {
    "id": 49,
    "title": "Rebel's Stand",
    "requirements": ["City Rule: Demonic"],
    "global_achievements": ["Annihilation of Order"]
  },
  {
    "id": 50,
    "title": "Ghost Fortress",
    "requirements": ["City Rule: Demonic"],
    "anti_requirements": ["Annihilation of Order"],
    "global_achievements": ["City Rule: Militaristic"]
  },
  {
    "id": 51,
    "title": "The Void",
    "requirements": [
      "End of Corruption",
      "End of Corruption",
      "End of Corruption"
    ],
    "global_achievements": ["End of Gloom"]
  },
  {
    "id": 52,
    "title": "The Noxious Cellar",
    "personal_requirements": ["Seaker of Xorn"],
    "scenario_type": "personal",
    "new_locations": [53]
  },
  {
    "id": 53,
    "title": "Crypt Basement",
    "personal_requirements": ["Seaker of Xorn"],
    "scenario_type": "personal",
    "new_locations": [54]
  },
  {
    "id": 54,
    "title": "Palace of Ice",
    "personal_requirements": ["Seaker of Xorn"],
    "scenario_type": "personal"
  },
  {
    "id": 55,
    "title": "Foggy Thicket",
    "personal_requirements": ["Take Back the Trees"],
    "scenario_type": "personal",
    "new_locations": [56]
  },
  {
    "id": 56,
    "title": "Bandit's Wood",
    "personal_requirements": ["Take Back the Trees"],
    "scenario_type": "personal"
  },
  {
    "id": 57,
    "title": "Investigation",
    "personal_requirements": ["Vengeance"],
    "scenario_type": "personal",
    "new_locations": [58]
  },
  {
    "id": 58,
    "title": "Bloody Shack",
    "personal_requirements": ["Vengeance"],
    "scenario_type": "personal"
  },
  {
    "id": 59,
    "title": "Forgotten Grove",
    "personal_requirements": ["Finding the Cure"],
    "scenario_type": "personal",
    "new_locations": [60]
  },
  {
    "id": 60,
    "title": "Alchemy Lab",
    "personal_requirements": ["Finding the Cure"],
    "scenario_type": "personal"
  },
  {
    "id": 61,
    "title": "Fading Lighthouse",
    "personal_requirements": ["The Fall of Man"],
    "scenario_type": "personal",
    "new_locations": [62]
  },
  {
    "id": 62,
    "title": "Pit of Souls",
    "personal_requirements": ["The Fall of Man"],
    "scenario_type": "personal"
  },
  {
    "id": 63,
    "title": "Magma Pit",
    "scenario_type": "random"
  },
  {
    "id": 64,
    "title": "Underwater Lagoon",
    "scenario_type": "random"
  },
  {
    "id": 65,
    "title": "Sulfur Mine",
    "global_achievements": ["Ancient Technology"],
    "scenario_type": "random"
  },
  {
    "id": 66,
    "title": "Clockwork Cove",
    "global_achievements": ["Ancient Technology"],
    "scenario_type": "random"
  },
  {
    "id": 67,
    "title": "Arcane Library",
    "global_achievements": ["Ancient Technology"],
    "scenario_type": "random"
  },
  {
    "id": 68,
    "title": "Toxic Moor",
    "scenario_type": "random"
  },
  {
    "id": 69,
    "title": "Well of the Unfortunate",
    "scenario_type": "random"
  },
  {
    "id": 70,
    "title": "Chained Isle",
    "scenario_type": "random"
  },
  {
    "id": 71,
    "title": "Windswept Highlands",
    "scenario_type": "random"
  },
  {
    "id": 72,
    "title": "Oozing Grove",
    "scenario_type": "sealed"
  },
  {
    "id": 73,
    "title": "Rockslide Ridge",
    "scenario_type": "sealed"
  },
  {
    "id": 74,
    "title": "Merchant Ship",
    "requirements": ["High Sea Escort"],
    "scenario_type": "city"
  },
  {
    "id": 75,
    "title": "Overgrown Graveyard",
    "requirements": ["Grave Job"],
    "scenario_type": "city"
  },
  {
    "id": 76,
    "title": "Harrower Hive",
    "requirements": ["Bravery"],
    "scenario_type": "sealed"
  },
  {
    "id": 77,
    "title": "Vault of Secrets",
    "scenario_type": "sealed"
  },
  {
    "id": 78,
    "title": "Sacrifice Pit",
    "scenario_type": "city"
  },
  {
    "id": 79,
    "title": "Lost Temple",
    "requirements": ["Fish's Aid"],
    "scenario_type": "city"
  },
  {
    "id": 80,
    "title": "Vigil Keep",
    "scenario_type": "road"
  },
  {
    "id": 81,
    "title": "Temple of the Eclipse",
    "scenario_type": "city"
  },
  {
    "id": 82,
    "title": "Burning Mountain",
    "scenario_type": "road"
  },
  {
    "id": 83,
    "title": "Shadows Within",
    "requirements": ["Bad Business"],
    "scenario_type": "city"
  },
  {
    "id": 84,
    "title": "Crystalline Cave",
    "requirements": ["Tremors"],
    "scenario_type": "city"
  },
  {
    "id": 85,
    "title": "Sun Temple",
    "scenario_type": "road"
  },
  {
    "id": 86,
    "title": "Harried Village",
    "party_achievements": ["The Poison's Source"],
    "scenario_type": "city",
    "new_locations": [87]
  },
  {
    "id": 87,
    "title": "Corrupted Cove",
    "requirements": ["The Poison's Source"],
    "scenario_type": "city"
  },
  {
    "id": 88,
    "title": "Plane of Water",
    "requirements": ["Water-Breathing", "Water Staff"],
    "scenario_type": "city"
  },
  {
    "id": 89,
    "title": "Syndicate Hideout",
    "requirements": ["Sin-Ra"],
    "scenario_type": "city"
  },
  {
    "id": 90,
    "title": "Demonic Rift",
    "scenario_type": "road"
  },
  {
    "id": 91,
    "title": "Wild Melee",
    "scenario_type": "city"
  },
  {
    "id": 92,
    "title": "Back Alley Brawl",
    "requirements": ["Debt Collection"],
    "scenario_type": "city"
  },
  {
    "id": 93,
    "title": "Sunken Vessel",
    "requirements": ["A Map to Treasure"],
    "scenario_type": "city"
  },
  {
    "id": 94,
    "title": "Vermling Nest",
    "party_achievements": ["Through the Nest"],
    "scenario_type": "city",
    "new_locations": [95]
  },
  {
    "id": 95,
    "title": "Payment Due",
    "requirements": ["Through the Nest"],
    "scenario_type": "city"
  }
]